[Killed] StringLiteral
src/rawSqlParams.ts:15:45
 };
 
 const getIntervalSeconds = (config: RawSqlChartConfig & Partial<DateRange>) => {
-  const granularity = config.granularity ?? 'auto';
+  const granularity = config.granularity ?? "";
 
   const effectiveGranularity =
killedBy: renderChartConfig raw sql macro replacement replaces $__timeInterval macro in raw sql Line config
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/rawSqlParams.ts:18:5
   const granularity = config.granularity ?? 'auto';
 
   const effectiveGranularity =
-    granularity === 'auto' && config.dateRange
+    granularity !== 'auto' && config.dateRange
       ? convertDateRangeToGranularityString(config.dateRange)
       : granularity;
killedBy: renderChartConfig raw sql macro replacement replaces $__timeInterval macro in raw sql Line config
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/rawSqlParams.ts:18:5
   const granularity = config.granularity ?? 'auto';
 
   const effectiveGranularity =
-    granularity === 'auto' && config.dateRange
+    true && config.dateRange
       ? convertDateRangeToGranularityString(config.dateRange)
       : granularity;
killedBy: renderRawSqlChartConfig DisplayType.Table DisplayType.Line returns the granularity from the config when available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 300
Received: 60

[Killed] ArithmeticOperator
src/rawSqlParams.ts:59:7
     type: 'Int64',
     description: 'time bucket size in milliseconds',
     get: (config: RawSqlChartConfig & Partial<DateRange>) =>
-      getIntervalSeconds(config) * 1000,
+      getIntervalSeconds(config) / 1000,
   },
 };
killedBy: renderRawSqlChartConfig DisplayType.Table DisplayType.Line injects all four params when dateRange is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1800000
Received: 1.8

[Killed] StringLiteral
src/rawSqlParams.ts:130:10
 
 export function renderQueryParam(name: keyof typeof QUERY_PARAMS): string {
   // eslint-disable-next-line security/detect-object-injection
-  return `{${QUERY_PARAMS[name].name}:${QUERY_PARAMS[name].type}}`;
+  return ``;
 }
 
killedBy: renderBuilderConfigAsSqlTemplate round-trips through replaceMacros into an executable, alert-valid query
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "{startDateMilliseconds:Int64}"
Received string:    "SELECT
  count(),
  ServiceName,
  toStartOfInterval(toDateTime(timestamp), INTERVAL  second) AS `__hdx_time_bucket`
FROM
