[Killed] BlockStatement
src/filters.ts:15:37
   };
 };
 
-const escapeString = (s: string) => {
-  return s.replace(/\\/g, '\\\\').replace(/'/g, "''");
-};
+const escapeString = (s: string) => {};
 
 // Wrap a quoted string literal in a ClickHouse expression whose result type
killedBy: renderOnClickSearch renders a single filter template as an IN clause
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "condition": "ServiceName IN ('MyService')",

[Killed] StringLiteral
src/filters.ts:16:49
 };
 
 const escapeString = (s: string) => {
-  return s.replace(/\\/g, '\\\\').replace(/'/g, "''");
+  return s.replace(/\\/g, '\\\\').replace(/'/g, "");
 };
 
killedBy: renderOnClickSearch escapes single quotes in rendered filter values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "condition": "ServiceName IN ('O''Malley')",

[Survived] Regex
src/filters.ts:22:29
 // Wrap a quoted string literal in a ClickHouse expression whose result type
 // matches the date column's type.
 const dateTimeValueExpr = (chType: string, quotedValue: string): string => {
-  const dt64 = chType.match(/DateTime64\((\d+)/);
+  const dt64 = chType.match(/DateTime64\((\d)/);
 
   if (dt64) {

[Killed] BlockStatement
src/filters.ts:24:13
 const dateTimeValueExpr = (chType: string, quotedValue: string): string => {
   const dt64 = chType.match(/DateTime64\((\d+)/);
 
-  if (dt64) {
-    return `parseDateTime64BestEffort(${quotedValue}, ${dt64[1]})`;
-  }
+  if (dt64) {}
 
   if (/\bDateTime\b/.test(chType)) {
killedBy: filters filtersToQuery dateTimeColumns matches the precision of a non-9 DateTime64 column
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "condition": "ts3 IN (parseDateTime64BestEffort('2026-06-17T11:56:41.123Z', 3))",

[Killed] ConditionalExpression
src/filters.ts:28:7
     return `parseDateTime64BestEffort(${quotedValue}, ${dt64[1]})`;
   }
 
-  if (/\bDateTime\b/.test(chType)) {
+  if (true) {
     return `parseDateTimeBestEffort(${quotedValue})`;
   }
killedBy: filters filtersToQuery dateTimeColumns wraps a Date column with toDate
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "condition": "day IN (toDate('2026-06-17'))",

[Killed] BlockStatement
src/filters.ts:28:36
     return `parseDateTime64BestEffort(${quotedValue}, ${dt64[1]})`;
   }
 
-  if (/\bDateTime\b/.test(chType)) {
-    return `parseDateTimeBestEffort(${quotedValue})`;
-  }
+  if (/\bDateTime\b/.test(chType)) {}
 
   if (/\bDate32\b/.test(chType)) {
killedBy: filters filtersToQuery dateTimeColumns wraps a plain DateTime column with parseDateTimeBestEffort (IN does not promote DateTime↔DateTime64)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "condition": "TimestampTime IN (parseDateTimeBestEffort('2026-06-17T11:56:41Z'))",

[Killed] StringLiteral
src/filters.ts:29:12
   }
 
   if (/\bDateTime\b/.test(chType)) {
-    return `parseDateTimeBestEffort(${quotedValue})`;
+    return ``;
   }
 
killedBy: filters filtersToQuery dateTimeColumns wraps a plain DateTime column with parseDateTimeBestEffort (IN does not promote DateTime↔DateTime64)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "condition": "TimestampTime IN (parseDateTimeBestEffort('2026-06-17T11:56:41Z'))",

[Killed] ConditionalExpression
src/filters.ts:32:7
     return `parseDateTimeBestEffort(${quotedValue})`;
   }
 
-  if (/\bDate32\b/.test(chType)) {
+  if (true) {
     return `toDate32(${quotedValue})`;
   }
killedBy: filters filtersToQuery dateTimeColumns wraps a Date column with toDate
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "condition": "day IN (toDate('2026-06-17'))",

[NoCoverage] BlockStatement
src/filters.ts:32:34
     return `parseDateTimeBestEffort(${quotedValue})`;
   }
 
-  if (/\bDate32\b/.test(chType)) {
-    return `toDate32(${quotedValue})`;
-  }
+  if (/\bDate32\b/.test(chType)) {}
 
   if (/\bDate\b/.test(chType)) {

[Killed] BlockStatement
src/filters.ts:36:32
     return `toDate32(${quotedValue})`;
   }
 
-  if (/\bDate\b/.test(chType)) {
-    return `toDate(${quotedValue})`;
-  }
+  if (/\bDate\b/.test(chType)) {}
 
   // Fallback for an unexpected type; DateTime64(9) covers the widest range.
killedBy: filters filtersToQuery dateTimeColumns wraps a Date column with toDate
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "condition": "day IN (toDate('2026-06-17'))",

[Killed] ConditionalExpression
src/filters.ts:36:7
     return `toDate32(${quotedValue})`;
   }
 
-  if (/\bDate\b/.test(chType)) {
+  if (false) {
     return `toDate(${quotedValue})`;
   }
killedBy: filters filtersToQuery dateTimeColumns wraps a Date column with toDate
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "condition": "day IN (toDate('2026-06-17'))",

[Killed] BooleanLiteral
src/filters.ts:47:21
 export const filtersToQuery = (
   filters: FilterState,
   {
-    stringifyKeys = false,
+    stringifyKeys = true,
     dateTimeColumns,
   }: {
killedBy: filters filtersToQuery should return query for one filter
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "condition": "a IN ('b')",

[Survived] MethodExpression
src/filters.ts:55:10
     dateTimeColumns?: ReadonlyMap<string, string>;
   } = {},
 ): Filter[] => {
-  return Object.entries(filters)
-    .filter(
-      ([_, values]) =>
-        values.included.size > 0 ||
-        values.excluded.size > 0 ||
-        values.range != null,
-    )
+  return Object.entries(filters)
     .flatMap(([key, values]) => {
       const conditions: Filter[] = [];

[Killed] ArrowFunction
src/filters.ts:57:7
 ): Filter[] => {
   return Object.entries(filters)
     .filter(
-      ([_, values]) =>
-        values.included.size > 0 ||
-        values.excluded.size > 0 ||
-        values.range != null,
+      () => undefined,
     )
     .flatMap(([key, values]) => {
killedBy: filters filtersToQuery should return query for one filter
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   Object {
-     "condition": "a IN ('b')",

[Killed] ConditionalExpression
src/filters.ts:58:9
   return Object.entries(filters)
     .filter(
       ([_, values]) =>
-        values.included.size > 0 ||
-        values.excluded.size > 0 ||
-        values.range != null,
+        false,
     )
     .flatMap(([key, values]) => {
killedBy: filters filtersToQuery should return query for one filter
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   Object {
-     "condition": "a IN ('b')",

[Killed] ConditionalExpression
src/filters.ts:58:9
   return Object.entries(filters)
     .filter(
       ([_, values]) =>
-        values.included.size > 0 ||
-        values.excluded.size > 0 ||
+        false ||
         values.range != null,
     )
killedBy: filters filtersToQuery should return query for one filter
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   Object {
-     "condition": "a IN ('b')",

[Killed] ConditionalExpression
src/filters.ts:59:9
     .filter(
       ([_, values]) =>
         values.included.size > 0 ||
-        values.excluded.size > 0 ||
+        false ||
         values.range != null,
     )
killedBy: filters filtersToQuery should should handle boolean filter values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 0

  Array [
    Object {
      "condition": "isRootSpan IN (true)",

[Killed] EqualityOperator
src/filters.ts:59:9
     .filter(
       ([_, values]) =>
         values.included.size > 0 ||
-        values.excluded.size > 0 ||
+        values.excluded.size <= 0 ||
         values.range != null,
     )
killedBy: filters filtersToQuery should should handle boolean filter values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 0

  Array [
    Object {
      "condition": "isRootSpan IN (true)",

[Killed] EqualityOperator
src/filters.ts:60:9
       ([_, values]) =>
         values.included.size > 0 ||
         values.excluded.size > 0 ||
-        values.range != null,
+        values.range == null,
     )
     .flatMap(([key, values]) => {
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Duration BETWEEN 100 AND 5000 (BETWEEN (numeric))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/filters.ts:60:9
       ([_, values]) =>
         values.included.size > 0 ||
         values.excluded.size > 0 ||
-        values.range != null,
+        false,
     )
     .flatMap(([key, values]) => {
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Duration BETWEEN 100 AND 5000 (BETWEEN (numeric))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/filters.ts:70:27
       // literal in ClickHouse, so wrap each value in a parse/convert expression whose
       // result type matches the column type.
       const chType = stringifyKeys ? undefined : dateTimeColumns?.get(key);
-      const formatValue = (v: string | boolean): string | boolean =>
-        typeof v !== 'string'
-          ? v
-          : chType != null
-            ? dateTimeValueExpr(chType, `'${escapeString(v)}'`)
-            : `'${escapeString(v)}'`;
+      const formatValue = () => undefined;
 
       if (values.included.size > 0) {
killedBy: filters filtersToQuery should return query for one filter
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "condition": "a IN ('b')",

[Killed] StringLiteral
src/filters.ts:74:41
         typeof v !== 'string'
           ? v
           : chType != null
-            ? dateTimeValueExpr(chType, `'${escapeString(v)}'`)
+            ? dateTimeValueExpr(chType, ``)
             : `'${escapeString(v)}'`;
 
killedBy: filters filtersToQuery dateTimeColumns wraps an excluded DateTime64 value in parseDateTime64BestEffort
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "condition": "Timestamp NOT IN (parseDateTime64BestEffort('2026-06-16T15:35:16.731000000Z', 9))",

[Killed] BlockStatement
src/filters.ts:77:37
             ? dateTimeValueExpr(chType, `'${escapeString(v)}'`)
             : `'${escapeString(v)}'`;
 
-      if (values.included.size > 0) {
-        conditions.push({
-          type: 'sql' as const,
-          condition: `${actualKey} IN (${Array.from(values.included)
-            .map(formatValue)
-            .join(', ')})`,
-        });
-      }
+      if (values.included.size > 0) {}
       if (values.excluded.size > 0) {
         conditions.push({
killedBy: filters filtersToQuery should return query for one filter
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   Object {
-     "condition": "a IN ('b')",

[Killed] ConditionalExpression
src/filters.ts:77:11
             ? dateTimeValueExpr(chType, `'${escapeString(v)}'`)
             : `'${escapeString(v)}'`;
 
-      if (values.included.size > 0) {
+      if (false) {
         conditions.push({
           type: 'sql' as const,
killedBy: filters filtersToQuery should return query for one filter
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   Object {
-     "condition": "a IN ('b')",

[Killed] StringLiteral
src/filters.ts:82:19
           type: 'sql' as const,
           condition: `${actualKey} IN (${Array.from(values.included)
             .map(formatValue)
-            .join(', ')})`,
+            .join("")})`,
         });
       }
killedBy: filters filtersToQuery should return query for multiple filters
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,9 +2,9 @@
    Object {
      "condition": "a IN ('b')",

[Killed] EqualityOperator
src/filters.ts:85:11
             .join(', ')})`,
         });
       }
-      if (values.excluded.size > 0) {
+      if (values.excluded.size >= 0) {
         conditions.push({
           type: 'sql' as const,
killedBy: filters filtersToQuery should return query for one filter
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

  Array [
    Object {
      "condition": "a IN ('b')",

[Killed] EqualityOperator
src/filters.ts:85:11
             .join(', ')})`,
         });
       }
-      if (values.excluded.size > 0) {
+      if (values.excluded.size <= 0) {
         conditions.push({
           type: 'sql' as const,
killedBy: filters filtersToQuery should return query for one filter
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

  Array [
    Object {
      "condition": "a IN ('b')",

[Killed] BlockStatement
src/filters.ts:93:33
             .join(', ')})`,
         });
       }
-      if (values.range != null) {
-        conditions.push({
-          type: 'sql' as const,
-          condition: `${actualKey} BETWEEN ${values.range.min} AND ${values.range.max}`,
-        });
-      }
+      if (values.range != null) {}
       return conditions;
     });
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Duration BETWEEN 100 AND 5000 (BETWEEN (numeric))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/filters.ts:96:22
       if (values.range != null) {
         conditions.push({
           type: 'sql' as const,
-          condition: `${actualKey} BETWEEN ${values.range.min} AND ${values.range.max}`,
+          condition: ``,
         });
       }
killedBy: filters isRenderablePinnedFilter accepts exactly what filtersToQuery emits (round-trip)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] MethodExpression
src/filters.ts:106:19
 // Helper function to parse a string value as boolean if possible, or otherwise
 // return as string with surrounding quotes removed and SQL-escaped quotes unescaped.
 const getBooleanOrUnquotedString = (value: string): string | boolean => {
-  const trimmed = value.trim();
+  const trimmed = value;
 
   if (['true', 'false'].includes(trimmed.toLowerCase())) {

[Survived] MethodExpression
src/filters.ts:108:34
 const getBooleanOrUnquotedString = (value: string): string | boolean => {
   const trimmed = value.trim();
 
-  if (['true', 'false'].includes(trimmed.toLowerCase())) {
+  if (['true', 'false'].includes(trimmed.toUpperCase())) {
     return trimmed.toLowerCase() === 'true';
   }

[NoCoverage] BlockStatement
src/filters.ts:108:58
 const getBooleanOrUnquotedString = (value: string): string | boolean => {
   const trimmed = value.trim();
 
-  if (['true', 'false'].includes(trimmed.toLowerCase())) {
-    return trimmed.toLowerCase() === 'true';
-  }
+  if (['true', 'false'].includes(trimmed.toLowerCase())) {}
 
   // Remove surrounding quotes and reverse the escape sequences produced by

[NoCoverage] MethodExpression
src/filters.ts:109:12
   const trimmed = value.trim();
 
   if (['true', 'false'].includes(trimmed.toLowerCase())) {
-    return trimmed.toLowerCase() === 'true';
+    return trimmed.toUpperCase() === 'true';
   }
 

[NoCoverage] ConditionalExpression
src/filters.ts:109:12
   const trimmed = value.trim();
 
   if (['true', 'false'].includes(trimmed.toLowerCase())) {
-    return trimmed.toLowerCase() === 'true';
+    return true;
   }
 

[Survived] MethodExpression
src/filters.ts:115:7
   // Remove surrounding quotes and reverse the escape sequences produced by
   // filtersToQuery's escapeString. Order matters: collapse \\ → \ first so
   // that the following '' → ' pass doesn't mistake content for an escape.
-  if (trimmed.startsWith("'") && trimmed.endsWith("'")) {
+  if (trimmed.endsWith("'") && trimmed.endsWith("'")) {
     return trimmed.slice(1, -1).replace(/\\\\/g, '\\').replace(/''/g, "'");
   }

[Survived] LogicalOperator
src/filters.ts:115:7
   // Remove surrounding quotes and reverse the escape sequences produced by
   // filtersToQuery's escapeString. Order matters: collapse \\ → \ first so
   // that the following '' → ' pass doesn't mistake content for an escape.
-  if (trimmed.startsWith("'") && trimmed.endsWith("'")) {
+  if (trimmed.startsWith("'") || trimmed.endsWith("'")) {
     return trimmed.slice(1, -1).replace(/\\\\/g, '\\').replace(/''/g, "'");
   }

[Survived] MethodExpression
src/filters.ts:116:12
   // filtersToQuery's escapeString. Order matters: collapse \\ → \ first so
   // that the following '' → ' pass doesn't mistake content for an escape.
   if (trimmed.startsWith("'") && trimmed.endsWith("'")) {
-    return trimmed.slice(1, -1).replace(/\\\\/g, '\\').replace(/''/g, "'");
+    return trimmed.replace(/\\\\/g, '\\').replace(/''/g, "'");
   }
   return trimmed;

[Survived] UnaryOperator
src/filters.ts:116:29
   // filtersToQuery's escapeString. Order matters: collapse \\ → \ first so
   // that the following '' → ' pass doesn't mistake content for an escape.
   if (trimmed.startsWith("'") && trimmed.endsWith("'")) {
-    return trimmed.slice(1, -1).replace(/\\\\/g, '\\').replace(/''/g, "'");
+    return trimmed.slice(1, +1).replace(/\\\\/g, '\\').replace(/''/g, "'");
   }
   return trimmed;

[Killed] ConditionalExpression
src/filters.ts:127:7
 // quote is escaped via \'; an even number (including zero) means the
 // backslashes are themselves escaped (\\) and the quote is a real boundary.
 function isQuoteBoundary(s: string, i: number): boolean {
-  if (s[i] !== "'") return false;
+  if (false) return false;
   let backslashes = 0;
   for (let j = i - 1; j >= 0 && s[j] === '\\'; j--) {
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Object {
-   "Duration": Object {
-     "excluded": Set {},

[Killed] BooleanLiteral
src/filters.ts:127:28
 // quote is escaped via \'; an even number (including zero) means the
 // backslashes are themselves escaped (\\) and the quote is a real boundary.
 function isQuoteBoundary(s: string, i: number): boolean {
-  if (s[i] !== "'") return false;
+  if (s[i] !== "'") return true;
   let backslashes = 0;
   for (let j = i - 1; j >= 0 && s[j] === '\\'; j--) {
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Object {
-   "Duration": Object {
-     "excluded": Set {},

[Killed] LogicalOperator
src/filters.ts:129:23
 function isQuoteBoundary(s: string, i: number): boolean {
   if (s[i] !== "'") return false;
   let backslashes = 0;
-  for (let j = i - 1; j >= 0 && s[j] === '\\'; j--) {
+  for (let j = i - 1; j >= 0 || s[j] === '\\'; j--) {
     backslashes++;
   }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Body IN ('a AND b') (value containing AND)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/filters.ts:129:33
 function isQuoteBoundary(s: string, i: number): boolean {
   if (s[i] !== "'") return false;
   let backslashes = 0;
-  for (let j = i - 1; j >= 0 && s[j] === '\\'; j--) {
+  for (let j = i - 1; j >= 0 && s[j] !== '\\'; j--) {
     backslashes++;
   }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Body IN ('a AND b') (value containing AND)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] UpdateOperator
src/filters.ts:130:5
   if (s[i] !== "'") return false;
   let backslashes = 0;
   for (let j = i - 1; j >= 0 && s[j] === '\\'; j--) {
-    backslashes++;
+    backslashes--;
   }
   return backslashes % 2 === 0;

[Killed] ConditionalExpression
src/filters.ts:132:10
   for (let j = i - 1; j >= 0 && s[j] === '\\'; j--) {
     backslashes++;
   }
-  return backslashes % 2 === 0;
+  return false;
 }
 
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Body IN ('a AND b') (value containing AND)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/filters.ts:132:10
   for (let j = i - 1; j >= 0 && s[j] === '\\'; j--) {
     backslashes++;
   }
-  return backslashes % 2 === 0;
+  return backslashes % 2 !== 0;
 }
 
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Body IN ('a AND b') (value containing AND)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/filters.ts:142:7
   s: string,
   i: number,
 ): { skip: boolean; next: number } {
-  if (i + 1 < s.length && s[i + 1] === "'") {
+  if (true) {
     return { skip: true, next: i + 1 };
   }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: LogAttributes['x'] IN ('y') (map-access column)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/filters.ts:142:27
   s: string,
   i: number,
 ): { skip: boolean; next: number } {
-  if (i + 1 < s.length && s[i + 1] === "'") {
+  if (i + 1 < s.length && true) {
     return { skip: true, next: i + 1 };
   }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: LogAttributes['x'] IN ('y') (map-access column)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BooleanLiteral
src/filters.ts:143:20
   i: number,
 ): { skip: boolean; next: number } {
   if (i + 1 < s.length && s[i + 1] === "'") {
-    return { skip: true, next: i + 1 };
+    return { skip: false, next: i + 1 };
   }
   return { skip: false, next: i };

[NoCoverage] ArithmeticOperator
src/filters.ts:143:32
   i: number,
 ): { skip: boolean; next: number } {
   if (i + 1 < s.length && s[i + 1] === "'") {
-    return { skip: true, next: i + 1 };
+    return { skip: true, next: i - 1 };
   }
   return { skip: false, next: i };

[Killed] BooleanLiteral
src/filters.ts:145:18
   if (i + 1 < s.length && s[i + 1] === "'") {
     return { skip: true, next: i + 1 };
   }
-  return { skip: false, next: i };
+  return { skip: true, next: i };
 }
 
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: LogAttributes['x'] IN ('y') (map-access column)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ArrayDeclaration
src/filters.ts:151:40
 // Helper function to split on commas while respecting quoted strings and booleans.
 // Handles SQL-escaped single quotes ('') inside quoted strings.
 function splitValuesOnComma(valuesStr: string): (string | boolean)[] {
-  const values: (string | boolean)[] = [];
+  const values: (string | boolean)[] = ["Stryker was here"];
   let currentValue = '';
   let inString = false;

[Survived] BooleanLiteral
src/filters.ts:153:18
 function splitValuesOnComma(valuesStr: string): (string | boolean)[] {
   const values: (string | boolean)[] = [];
   let currentValue = '';
-  let inString = false;
+  let inString = true;
 
   for (let i = 0; i < valuesStr.length; i++) {

[Killed] EqualityOperator
src/filters.ts:155:19
   let currentValue = '';
   let inString = false;
 
-  for (let i = 0; i < valuesStr.length; i++) {
+  for (let i = 0; i >= valuesStr.length; i++) {
     const char = valuesStr[i];
 
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/filters.ts:155:19
   let currentValue = '';
   let inString = false;
 
-  for (let i = 0; i < valuesStr.length; i++) {
+  for (let i = 0; false; i++) {
     const char = valuesStr[i];
 
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/filters.ts:158:9
   for (let i = 0; i < valuesStr.length; i++) {
     const char = valuesStr[i];
 
-    if (isQuoteBoundary(valuesStr, i)) {
+    if (false) {
       if (inString) {
         const esc = handleQuoteEscape(valuesStr, i);

[Survived] BlockStatement
src/filters.ts:158:40
   for (let i = 0; i < valuesStr.length; i++) {
     const char = valuesStr[i];
 
-    if (isQuoteBoundary(valuesStr, i)) {
-      if (inString) {
-        const esc = handleQuoteEscape(valuesStr, i);
-        if (esc.skip) {
-          currentValue += "''";
-          i = esc.next;
-          continue;
-        }
-      }
-      inString = !inString;
-      currentValue += char;
-      continue;
-    }
+    if (isQuoteBoundary(valuesStr, i)) {}
 
     if (!inString && char === ',') {

[Survived] BlockStatement
src/filters.ts:159:21
     const char = valuesStr[i];
 
     if (isQuoteBoundary(valuesStr, i)) {
-      if (inString) {
-        const esc = handleQuoteEscape(valuesStr, i);
-        if (esc.skip) {
-          currentValue += "''";
-          i = esc.next;
-          continue;
-        }
-      }
+      if (inString) {}
       inString = !inString;
       currentValue += char;

[Survived] ConditionalExpression
src/filters.ts:159:11
     const char = valuesStr[i];
 
     if (isQuoteBoundary(valuesStr, i)) {
-      if (inString) {
+      if (true) {
         const esc = handleQuoteEscape(valuesStr, i);
         if (esc.skip) {

[NoCoverage] BlockStatement
src/filters.ts:161:23
     if (isQuoteBoundary(valuesStr, i)) {
       if (inString) {
         const esc = handleQuoteEscape(valuesStr, i);
-        if (esc.skip) {
-          currentValue += "''";
-          i = esc.next;
-          continue;
-        }
+        if (esc.skip) {}
       }
       inString = !inString;

[Survived] ConditionalExpression
src/filters.ts:161:13
     if (isQuoteBoundary(valuesStr, i)) {
       if (inString) {
         const esc = handleQuoteEscape(valuesStr, i);
-        if (esc.skip) {
+        if (true) {
           currentValue += "''";
           i = esc.next;

[Survived] BooleanLiteral
src/filters.ts:167:18
           continue;
         }
       }
-      inString = !inString;
+      inString = inString;
       currentValue += char;
       continue;

[Survived] ConditionalExpression
src/filters.ts:172:9
       continue;
     }
 
-    if (!inString && char === ',') {
+    if (false) {
       if (currentValue.trim()) {
         values.push(getBooleanOrUnquotedString(currentValue));

[Survived] LogicalOperator
src/filters.ts:172:9
       continue;
     }
 
-    if (!inString && char === ',') {
+    if (!inString || char === ',') {
       if (currentValue.trim()) {
         values.push(getBooleanOrUnquotedString(currentValue));

[Survived] MethodExpression
src/filters.ts:173:11
     }
 
     if (!inString && char === ',') {
-      if (currentValue.trim()) {
+      if (currentValue) {
         values.push(getBooleanOrUnquotedString(currentValue));
       }

[Survived] ConditionalExpression
src/filters.ts:173:11
     }
 
     if (!inString && char === ',') {
-      if (currentValue.trim()) {
+      if (true) {
         values.push(getBooleanOrUnquotedString(currentValue));
       }

[Survived] StringLiteral
src/filters.ts:176:22
       if (currentValue.trim()) {
         values.push(getBooleanOrUnquotedString(currentValue));
       }
-      currentValue = '';
+      currentValue = "Stryker was here!";
       continue;
     }

[Killed] BlockStatement
src/filters.ts:184:28
   }
 
   // Add the last value
-  if (currentValue.trim()) {
-    values.push(getBooleanOrUnquotedString(currentValue));
-  }
+  if (currentValue.trim()) {}
 
   return values;
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: LogAttributes['x'] IN ('y') (map-access column)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/filters.ts:184:7
   }
 
   // Add the last value
-  if (currentValue.trim()) {
+  if (false) {
     values.push(getBooleanOrUnquotedString(currentValue));
   }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: LogAttributes['x'] IN ('y') (map-access column)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
