[Killed] BooleanLiteral
src/filters.ts:198:18
   text: string,
   targets: (string | { char: string })[],
 ): boolean {
-  let inString = false;
+  let inString = true;
   for (let i = 0; i < text.length; i++) {
     const char = text[i];
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Object {
-   "Duration": Object {
-     "excluded": Set {},

[Killed] BlockStatement
src/filters.ts:199:41
   targets: (string | { char: string })[],
 ): boolean {
   let inString = false;
-  for (let i = 0; i < text.length; i++) {
-    const char = text[i];
-    if (isQuoteBoundary(text, i)) {
-      if (inString) {
-        const esc = handleQuoteEscape(text, i);
-        if (esc.skip) {
-          i = esc.next;
-          continue;
-        }
-      }
-      inString = !inString;
-      continue;
-    }
-    if (inString) continue;
-
-    for (const target of targets) {
-      if (typeof target === 'object') {
-        if (char === target.char) return true;
-      } else {
-        if (text.slice(i, i + target.length).toUpperCase() === target)
-          return true;
-      }
-    }
-  }
+  for (let i = 0; i < text.length; i++) {}
   return false;
 }
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Object {
-   "Duration": Object {
-     "excluded": Set {},

[Timeout] UpdateOperator
src/filters.ts:199:36
   targets: (string | { char: string })[],
 ): boolean {
   let inString = false;
-  for (let i = 0; i < text.length; i++) {
+  for (let i = 0; i < text.length; i--) {
     const char = text[i];
     if (isQuoteBoundary(text, i)) {

[Survived] ConditionalExpression
src/filters.ts:201:9
   let inString = false;
   for (let i = 0; i < text.length; i++) {
     const char = text[i];
-    if (isQuoteBoundary(text, i)) {
+    if (false) {
       if (inString) {
         const esc = handleQuoteEscape(text, i);

[Survived] BlockStatement
src/filters.ts:201:35
   let inString = false;
   for (let i = 0; i < text.length; i++) {
     const char = text[i];
-    if (isQuoteBoundary(text, i)) {
-      if (inString) {
-        const esc = handleQuoteEscape(text, i);
-        if (esc.skip) {
-          i = esc.next;
-          continue;
-        }
-      }
-      inString = !inString;
-      continue;
-    }
+    if (isQuoteBoundary(text, i)) {}
     if (inString) continue;
 

[Survived] ConditionalExpression
src/filters.ts:202:11
   for (let i = 0; i < text.length; i++) {
     const char = text[i];
     if (isQuoteBoundary(text, i)) {
-      if (inString) {
+      if (true) {
         const esc = handleQuoteEscape(text, i);
         if (esc.skip) {

[Survived] ConditionalExpression
src/filters.ts:202:11
   for (let i = 0; i < text.length; i++) {
     const char = text[i];
     if (isQuoteBoundary(text, i)) {
-      if (inString) {
+      if (false) {
         const esc = handleQuoteEscape(text, i);
         if (esc.skip) {

[Killed] ConditionalExpression
src/filters.ts:204:13
     if (isQuoteBoundary(text, i)) {
       if (inString) {
         const esc = handleQuoteEscape(text, i);
-        if (esc.skip) {
+        if (true) {
           i = esc.next;
           continue;
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: LogAttributes['x'] IN ('y') (map-access column)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BlockStatement
src/filters.ts:204:23
     if (isQuoteBoundary(text, i)) {
       if (inString) {
         const esc = handleQuoteEscape(text, i);
-        if (esc.skip) {
-          i = esc.next;
-          continue;
-        }
+        if (esc.skip) {}
       }
       inString = !inString;

[Survived] ConditionalExpression
src/filters.ts:212:9
       inString = !inString;
       continue;
     }
-    if (inString) continue;
+    if (false) continue;
 
     for (const target of targets) {

[Killed] BlockStatement
src/filters.ts:214:35
     }
     if (inString) continue;
 
-    for (const target of targets) {
-      if (typeof target === 'object') {
-        if (char === target.char) return true;
-      } else {
-        if (text.slice(i, i + target.length).toUpperCase() === target)
-          return true;
-      }
-    }
+    for (const target of targets) {}
   }
   return false;
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Object {
-   "Duration": Object {
-     "excluded": Set {},

[Survived] BlockStatement
src/filters.ts:215:39
     if (inString) continue;
 
     for (const target of targets) {
-      if (typeof target === 'object') {
-        if (char === target.char) return true;
-      } else {
+      if (typeof target === 'object') {} else {
         if (text.slice(i, i + target.length).toUpperCase() === target)
           return true;

[Killed] EqualityOperator
src/filters.ts:216:13
 
     for (const target of targets) {
       if (typeof target === 'object') {
-        if (char === target.char) return true;
+        if (char !== target.char) return true;
       } else {
         if (text.slice(i, i + target.length).toUpperCase() === target)
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/filters.ts:216:13
 
     for (const target of targets) {
       if (typeof target === 'object') {
-        if (char === target.char) return true;
+        if (true) return true;
       } else {
         if (text.slice(i, i + target.length).toUpperCase() === target)
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/filters.ts:217:14
     for (const target of targets) {
       if (typeof target === 'object') {
         if (char === target.char) return true;
-      } else {
-        if (text.slice(i, i + target.length).toUpperCase() === target)
-          return true;
-      }
+      } else {}
     }
   }
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Object {
-   "Duration": Object {
-     "excluded": Set {},

[Killed] ConditionalExpression
src/filters.ts:218:13
       if (typeof target === 'object') {
         if (char === target.char) return true;
       } else {
-        if (text.slice(i, i + target.length).toUpperCase() === target)
+        if (true)
           return true;
       }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/filters.ts:218:27
       if (typeof target === 'object') {
         if (char === target.char) return true;
       } else {
-        if (text.slice(i, i + target.length).toUpperCase() === target)
+        if (text.slice(i, i - target.length).toUpperCase() === target)
           return true;
       }
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Object {
-   "Duration": Object {
-     "excluded": Set {},

[Killed] BooleanLiteral
src/filters.ts:219:18
         if (char === target.char) return true;
       } else {
         if (text.slice(i, i + target.length).toUpperCase() === target)
-          return true;
+          return false;
       }
     }
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Object {
-   "Duration": Object {
-     "excluded": Set {},

[Survived] StringLiteral
src/filters.ts:230:13
   return containsOutsideQuotes(part, [
     { char: '=' },
     { char: '<' },
-    { char: '>' },
+    { char: "" },
     ' OR ',
   ]);

[Killed] StringLiteral
src/filters.ts:231:5
     { char: '=' },
     { char: '<' },
     { char: '>' },
-    ' OR ',
+    "",
   ]);
 }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/filters.ts:241:18
   text: string,
   delimiter: string,
 ): [string, string] | null {
-  let inString = false;
+  let inString = true;
   const upper = delimiter.toUpperCase();
   for (let i = 0; i < text.length; i++) {
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/filters.ts:242:17
   delimiter: string,
 ): [string, string] | null {
   let inString = false;
-  const upper = delimiter.toUpperCase();
+  const upper = delimiter.toLowerCase();
   for (let i = 0; i < text.length; i++) {
     if (isQuoteBoundary(text, i)) {
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/filters.ts:243:19
 ): [string, string] | null {
   let inString = false;
   const upper = delimiter.toUpperCase();
-  for (let i = 0; i < text.length; i++) {
+  for (let i = 0; false; i++) {
     if (isQuoteBoundary(text, i)) {
       if (inString) {
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/filters.ts:243:19
 ): [string, string] | null {
   let inString = false;
   const upper = delimiter.toUpperCase();
-  for (let i = 0; i < text.length; i++) {
+  for (let i = 0; i >= text.length; i++) {
     if (isQuoteBoundary(text, i)) {
       if (inString) {
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/filters.ts:244:9
   let inString = false;
   const upper = delimiter.toUpperCase();
   for (let i = 0; i < text.length; i++) {
-    if (isQuoteBoundary(text, i)) {
+    if (true) {
       if (inString) {
         const esc = handleQuoteEscape(text, i);
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BlockStatement
src/filters.ts:244:35
   let inString = false;
   const upper = delimiter.toUpperCase();
   for (let i = 0; i < text.length; i++) {
-    if (isQuoteBoundary(text, i)) {
-      if (inString) {
-        const esc = handleQuoteEscape(text, i);
-        if (esc.skip) {
-          i = esc.next;
-          continue;
-        }
-      }
-      inString = !inString;
-      continue;
-    }
+    if (isQuoteBoundary(text, i)) {}
     if (inString) continue;
     if (text.slice(i, i + upper.length).toUpperCase() === upper) {

[Survived] BlockStatement
src/filters.ts:245:21
   const upper = delimiter.toUpperCase();
   for (let i = 0; i < text.length; i++) {
     if (isQuoteBoundary(text, i)) {
-      if (inString) {
-        const esc = handleQuoteEscape(text, i);
-        if (esc.skip) {
-          i = esc.next;
-          continue;
-        }
-      }
+      if (inString) {}
       inString = !inString;
       continue;

[Killed] ConditionalExpression
src/filters.ts:255:9
       inString = !inString;
       continue;
     }
-    if (inString) continue;
+    if (true) continue;
     if (text.slice(i, i + upper.length).toUpperCase() === upper) {
       return [text.slice(0, i), text.slice(i + upper.length)];
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/filters.ts:256:23
       continue;
     }
     if (inString) continue;
-    if (text.slice(i, i + upper.length).toUpperCase() === upper) {
+    if (text.slice(i, i - upper.length).toUpperCase() === upper) {
       return [text.slice(0, i), text.slice(i + upper.length)];
     }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/filters.ts:256:9
       continue;
     }
     if (inString) continue;
-    if (text.slice(i, i + upper.length).toUpperCase() === upper) {
+    if (text.slice(i, i + upper.length).toUpperCase() !== upper) {
       return [text.slice(0, i), text.slice(i + upper.length)];
     }
killedBy: filters isRenderablePinnedFilter rejects NOT (ServiceName IN ('x')) (leading NOT folded into the key)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/filters.ts:257:15
     }
     if (inString) continue;
     if (text.slice(i, i + upper.length).toUpperCase() === upper) {
-      return [text.slice(0, i), text.slice(i + upper.length)];
+      return [text, text.slice(i + upper.length)];
     }
   }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: SeverityText NOT IN ('debug', 'trace') (NOT IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ArithmeticOperator
src/filters.ts:257:44
     }
     if (inString) continue;
     if (text.slice(i, i + upper.length).toUpperCase() === upper) {
-      return [text.slice(0, i), text.slice(i + upper.length)];
+      return [text.slice(0, i), text.slice(i - upper.length)];
     }
   }

[Survived] ArrayDeclaration
src/filters.ts:277:27
   }> = [];
 
   // Split on ' AND ' while respecting quoted strings (including SQL-escaped quotes)
-  const parts: string[] = [];
+  const parts: string[] = ["Stryker was here"];
   let currentPart = '';
   let inString = false;

[Survived] StringLiteral
src/filters.ts:278:21
 
   // Split on ' AND ' while respecting quoted strings (including SQL-escaped quotes)
   const parts: string[] = [];
-  let currentPart = '';
+  let currentPart = "Stryker was here!";
   let inString = false;
 

[Survived] BooleanLiteral
src/filters.ts:279:18
   // Split on ' AND ' while respecting quoted strings (including SQL-escaped quotes)
   const parts: string[] = [];
   let currentPart = '';
-  let inString = false;
+  let inString = true;
 
   for (let i = 0; i < condition.length; i++) {

[Killed] ConditionalExpression
src/filters.ts:281:19
   let currentPart = '';
   let inString = false;
 
-  for (let i = 0; i < condition.length; i++) {
+  for (let i = 0; false; i++) {
     const char = condition[i];
 
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Timeout] UpdateOperator
src/filters.ts:281:41
   let currentPart = '';
   let inString = false;
 
-  for (let i = 0; i < condition.length; i++) {
+  for (let i = 0; i < condition.length; i--) {
     const char = condition[i];
 

[Survived] ConditionalExpression
src/filters.ts:284:9
   for (let i = 0; i < condition.length; i++) {
     const char = condition[i];
 
-    if (isQuoteBoundary(condition, i)) {
+    if (false) {
       if (inString) {
         const esc = handleQuoteEscape(condition, i);

[Survived] BlockStatement
src/filters.ts:284:40
   for (let i = 0; i < condition.length; i++) {
     const char = condition[i];
 
-    if (isQuoteBoundary(condition, i)) {
-      if (inString) {
-        const esc = handleQuoteEscape(condition, i);
-        if (esc.skip) {
-          currentPart += "''";
-          i = esc.next;
-          continue;
-        }
-      }
-      inString = !inString;
-      currentPart += char;
-      continue;
-    }
+    if (isQuoteBoundary(condition, i)) {}
 
     if (!inString && condition.slice(i, i + 5).toUpperCase() === ' AND ') {

[Survived] ConditionalExpression
src/filters.ts:285:11
     const char = condition[i];
 
     if (isQuoteBoundary(condition, i)) {
-      if (inString) {
+      if (false) {
         const esc = handleQuoteEscape(condition, i);
         if (esc.skip) {

[Survived] BlockStatement
src/filters.ts:285:21
     const char = condition[i];
 
     if (isQuoteBoundary(condition, i)) {
-      if (inString) {
-        const esc = handleQuoteEscape(condition, i);
-        if (esc.skip) {
-          currentPart += "''";
-          i = esc.next;
-          continue;
-        }
-      }
+      if (inString) {}
       inString = !inString;
       currentPart += char;

[Killed] ConditionalExpression
src/filters.ts:287:13
     if (isQuoteBoundary(condition, i)) {
       if (inString) {
         const esc = handleQuoteEscape(condition, i);
-        if (esc.skip) {
+        if (true) {
           currentPart += "''";
           i = esc.next;
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: LogAttributes['x'] IN ('y') (map-access column)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/filters.ts:287:13
     if (isQuoteBoundary(condition, i)) {
       if (inString) {
         const esc = handleQuoteEscape(condition, i);
-        if (esc.skip) {
+        if (false) {
           currentPart += "''";
           i = esc.next;

[Killed] EqualityOperator
src/filters.ts:298:22
       continue;
     }
 
-    if (!inString && condition.slice(i, i + 5).toUpperCase() === ' AND ') {
+    if (!inString && condition.slice(i, i + 5).toUpperCase() !== ' AND ') {
       if (currentPart.trim()) {
         parts.push(currentPart.trim());
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/filters.ts:298:9
       continue;
     }
 
-    if (!inString && condition.slice(i, i + 5).toUpperCase() === ' AND ') {
+    if (!inString || condition.slice(i, i + 5).toUpperCase() === ' AND ') {
       if (currentPart.trim()) {
         parts.push(currentPart.trim());
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/filters.ts:299:11
     }
 
     if (!inString && condition.slice(i, i + 5).toUpperCase() === ' AND ') {
-      if (currentPart.trim()) {
+      if (false) {
         parts.push(currentPart.trim());
       }

[Survived] ConditionalExpression
src/filters.ts:299:11
     }
 
     if (!inString && condition.slice(i, i + 5).toUpperCase() === ' AND ') {
-      if (currentPart.trim()) {
+      if (true) {
         parts.push(currentPart.trim());
       }

[Survived] MethodExpression
src/filters.ts:300:20
 
     if (!inString && condition.slice(i, i + 5).toUpperCase() === ' AND ') {
       if (currentPart.trim()) {
-        parts.push(currentPart.trim());
+        parts.push(currentPart);
       }
       currentPart = '';

[Survived] AssignmentOperator
src/filters.ts:303:7
         parts.push(currentPart.trim());
       }
       currentPart = '';
-      i += 4; // Skip past ' AND '
+      i -= 4; // Skip past ' AND '
       continue;
     }

[Killed] ConditionalExpression
src/filters.ts:310:7
     currentPart += char;
   }
 
-  if (currentPart.trim()) {
+  if (false) {
     parts.push(currentPart.trim());
   }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/filters.ts:310:27
     currentPart += char;
   }
 
-  if (currentPart.trim()) {
-    parts.push(currentPart.trim());
-  }
+  if (currentPart.trim()) {}
 
   // Process each part to extract IN/NOT IN clauses
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/filters.ts:318:9
   for (const part of parts) {
     // Skip parts that contain OR (not supported) or comparison operators,
     // but only when those operators appear outside of quoted strings.
-    if (containsOperatorOutsideQuotes(part)) {
+    if (false) {
       continue;
     }

[Survived] BlockStatement
src/filters.ts:318:46
   for (const part of parts) {
     // Skip parts that contain OR (not supported) or comparison operators,
     // but only when those operators appear outside of quoted strings.
-    if (containsOperatorOutsideQuotes(part)) {
-      continue;
-    }
+    if (containsOperatorOutsideQuotes(part)) {}
 
     const isExclude = containsOutsideQuotes(part, [' NOT IN ']);

[Killed] ConditionalExpression
src/filters.ts:323:19
     }
 
     const isExclude = containsOutsideQuotes(part, [' NOT IN ']);
-    const hasIn = isExclude || containsOutsideQuotes(part, [' IN ']);
+    const hasIn = false;
 
     if (hasIn) {
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/filters.ts:323:19
     }
 
     const isExclude = containsOutsideQuotes(part, [' NOT IN ']);
-    const hasIn = isExclude || containsOutsideQuotes(part, [' IN ']);
+    const hasIn = isExclude && containsOutsideQuotes(part, [' IN ']);
 
     if (hasIn) {
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/filters.ts:325:9
     const isExclude = containsOutsideQuotes(part, [' NOT IN ']);
     const hasIn = isExclude || containsOutsideQuotes(part, [' IN ']);
 
-    if (hasIn) {
+    if (true) {
       // Split on the first unquoted ' IN ' / ' NOT IN '
       const splitResult = splitOnFirstOutsideQuotes(

[Killed] StringLiteral
src/filters.ts:329:34
       // Split on the first unquoted ' IN ' / ' NOT IN '
       const splitResult = splitOnFirstOutsideQuotes(
         part,
-        isExclude ? ' NOT IN ' : ' IN ',
+        isExclude ? ' NOT IN ' : "",
       );
       if (!splitResult) continue;
killedBy: filters isRenderablePinnedFilter rejects NOT (ServiceName IN ('x')) (leading NOT folded into the key)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] MethodExpression
src/filters.ts:334:22
       if (!splitResult) continue;
       const [key, values] = splitResult;
 
-      const keyStr = key.trim();
+      const keyStr = key;
       const trimmedValues = values.trim();
       const withoutParens =

[Survived] MethodExpression
src/filters.ts:335:29
       const [key, values] = splitResult;
 
       const keyStr = key.trim();
-      const trimmedValues = values.trim();
+      const trimmedValues = values;
       const withoutParens =
         trimmedValues.startsWith('(') && trimmedValues.endsWith(')')

[Survived] MethodExpression
src/filters.ts:337:42
       const keyStr = key.trim();
       const trimmedValues = values.trim();
       const withoutParens =
-        trimmedValues.startsWith('(') && trimmedValues.endsWith(')')
+        trimmedValues.startsWith('(') && trimmedValues.startsWith(')')
           ? trimmedValues.slice(1, -1)
           : trimmedValues;

[Survived] MethodExpression
src/filters.ts:337:9
       const keyStr = key.trim();
       const trimmedValues = values.trim();
       const withoutParens =
-        trimmedValues.startsWith('(') && trimmedValues.endsWith(')')
+        trimmedValues.endsWith('(') && trimmedValues.endsWith(')')
           ? trimmedValues.slice(1, -1)
           : trimmedValues;

[Killed] UnaryOperator
src/filters.ts:338:36
       const trimmedValues = values.trim();
       const withoutParens =
         trimmedValues.startsWith('(') && trimmedValues.endsWith(')')
-          ? trimmedValues.slice(1, -1)
+          ? trimmedValues.slice(1, +1)
           : trimmedValues;
 
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] MethodExpression
src/filters.ts:338:13
       const trimmedValues = values.trim();
       const withoutParens =
         trimmedValues.startsWith('(') && trimmedValues.endsWith(')')
-          ? trimmedValues.slice(1, -1)
+          ? trimmedValues
           : trimmedValues;
 

[Survived] Regex
src/filters.ts:351:9
       // precision argument. Matches the four producers in `dateTimeValueExpr`:
       // parseDateTime64BestEffort, parseDateTimeBestEffort, toDate32, toDate.
       const unwrapped = withoutParens.replace(
-        /(?:parseDateTime64BestEffort|parseDateTimeBestEffort|toDate32|toDate)\(('(?:[^']|'')*')(?:\s*,\s*\d+)?\)/g,
+        /(?:parseDateTime64BestEffort|parseDateTimeBestEffort|toDate32|toDate)\(('(?:[']|'')*')(?:\s*,\s*\d+)?\)/g,
         '$1',
       );

[Survived] StringLiteral
src/filters.ts:352:9
       // parseDateTime64BestEffort, parseDateTimeBestEffort, toDate32, toDate.
       const unwrapped = withoutParens.replace(
         /(?:parseDateTime64BestEffort|parseDateTimeBestEffort|toDate32|toDate)\(('(?:[^']|'')*')(?:\s*,\s*\d+)?\)/g,
-        '$1',
+        "",
       );
 

[Survived] ConditionalExpression
src/filters.ts:385:9
     if (filter.type !== 'sql') continue;
 
     // Check for BETWEEN condition (only when BETWEEN appears outside quotes)
-    if (containsOutsideQuotes(filter.condition, [' BETWEEN '])) {
+    if (true) {
       const betweenMatch = filter.condition.match(
         /^(.+?)\s+BETWEEN\s+(.+?)\s+AND\s+(.+?)$/i,

[Killed] ArrayDeclaration
src/filters.ts:385:49
     if (filter.type !== 'sql') continue;
 
     // Check for BETWEEN condition (only when BETWEEN appears outside quotes)
-    if (containsOutsideQuotes(filter.condition, [' BETWEEN '])) {
+    if (containsOutsideQuotes(filter.condition, [])) {
       const betweenMatch = filter.condition.match(
         /^(.+?)\s+BETWEEN\s+(.+?)\s+AND\s+(.+?)$/i,
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Object {
-   "Duration": Object {
-     "excluded": Set {},

[Killed] Regex
src/filters.ts:387:9
     // Check for BETWEEN condition (only when BETWEEN appears outside quotes)
     if (containsOutsideQuotes(filter.condition, [' BETWEEN '])) {
       const betweenMatch = filter.condition.match(
-        /^(.+?)\s+BETWEEN\s+(.+?)\s+AND\s+(.+?)$/i,
+        /^(.+?)\s+BETWEEN\s+(.)\s+AND\s+(.+?)$/i,
       );
       if (betweenMatch) {
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Object {
-   "Duration": Object {
-     "excluded": Set {},

[Killed] Regex
src/filters.ts:387:9
     // Check for BETWEEN condition (only when BETWEEN appears outside quotes)
     if (containsOutsideQuotes(filter.condition, [' BETWEEN '])) {
       const betweenMatch = filter.condition.match(
-        /^(.+?)\s+BETWEEN\s+(.+?)\s+AND\s+(.+?)$/i,
+        /^(.)\s+BETWEEN\s+(.+?)\s+AND\s+(.+?)$/i,
       );
       if (betweenMatch) {
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Object {
-   "Duration": Object {
-     "excluded": Set {},

[Survived] MethodExpression
src/filters.ts:391:24
       );
       if (betweenMatch) {
         const [, key, minVal, maxVal] = betweenMatch;
-        const keyStr = key.trim();
+        const keyStr = key;
         // Use `Number` (not `parseFloat`) so both bounds must be *entirely*
         // numeric. This rejects quoted/date operands (`'2024-01-01'` → NaN) and
