[Survived] MethodExpression
src/filters.ts:398:28
         // condition (`... AND 2 AND other IN ('x')` → NaN), rather than
         // emitting a `BETWEEN NaN AND NaN` range. A non-numeric BETWEEN
         // contributes nothing (the sidebar range facet only handles numbers).
-        const min = Number(minVal.trim());
+        const min = Number(minVal);
         const max = Number(maxVal.trim());
 

[Survived] MethodExpression
src/filters.ts:399:28
         // emitting a `BETWEEN NaN AND NaN` range. A non-numeric BETWEEN
         // contributes nothing (the sidebar range facet only handles numbers).
         const min = Number(minVal.trim());
-        const max = Number(maxVal.trim());
+        const max = Number(maxVal);
 
         if (Number.isFinite(min) && Number.isFinite(max)) {

[Killed] ConditionalExpression
src/filters.ts:401:13
         const min = Number(minVal.trim());
         const max = Number(maxVal.trim());
 
-        if (Number.isFinite(min) && Number.isFinite(max)) {
+        if (true) {
           if (!state.has(keyStr)) {
             state.set(keyStr, {
killedBy: filters parseQuery BETWEEN bounds drops a BETWEEN with quoted / non-numeric bounds instead of emitting NaN
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 10

- Object {}
+ Object {
+   "ts": Object {

[Killed] ConditionalExpression
src/filters.ts:401:13
         const min = Number(minVal.trim());
         const max = Number(maxVal.trim());
 
-        if (Number.isFinite(min) && Number.isFinite(max)) {
+        if (false) {
           if (!state.has(keyStr)) {
             state.set(keyStr, {
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Object {
-   "Duration": Object {
-     "excluded": Set {},

[Killed] BooleanLiteral
src/filters.ts:402:15
         const max = Number(maxVal.trim());
 
         if (Number.isFinite(min) && Number.isFinite(max)) {
-          if (!state.has(keyStr)) {
+          if (state.has(keyStr)) {
             state.set(keyStr, {
               included: new Set(),
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: TypeError: Cannot set properties of undefined (setting 'range')

[Killed] ConditionalExpression
src/filters.ts:402:15
         const max = Number(maxVal.trim());
 
         if (Number.isFinite(min) && Number.isFinite(max)) {
-          if (!state.has(keyStr)) {
+          if (false) {
             state.set(keyStr, {
               included: new Set(),
killedBy: filters parseQuery BETWEEN bounds parses a numeric BETWEEN into a range
statusReason: TypeError: Cannot set properties of undefined (setting 'range')

[NoCoverage] BlockStatement
src/filters.ts:408:18
               excluded: new Set(),
               range: { min, max },
             });
-          } else {
-            const existing = state.get(keyStr)!;
-            existing.range = { min, max };
-          }
+          } else {}
         }
         continue;

[Killed] BlockStatement
src/filters.ts:421:37
     // This handles both simple conditions and compound conditions with AND/OR
     const inClauses = extractInClauses(filter.condition);
 
-    for (const clause of inClauses) {
-      if (!state.has(clause.key)) {
-        state.set(clause.key, { included: new Set(), excluded: new Set() });
-      }
-      const sets = state.get(clause.key)!;
-      clause.values.forEach(v => {
-        if (clause.isExclude) {
-          sets.excluded.add(v);
-        } else {
-          sets.included.add(v);
-        }
-      });
-    }
+    for (const clause of inClauses) {}
   }
   return { filters: Object.fromEntries(state) };
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/filters.ts:422:35
     const inClauses = extractInClauses(filter.condition);
 
     for (const clause of inClauses) {
-      if (!state.has(clause.key)) {
-        state.set(clause.key, { included: new Set(), excluded: new Set() });
-      }
+      if (!state.has(clause.key)) {}
       const sets = state.get(clause.key)!;
       clause.values.forEach(v => {
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: TypeError: Cannot read properties of undefined (reading 'included')

[Killed] BooleanLiteral
src/filters.ts:422:11
     const inClauses = extractInClauses(filter.condition);
 
     for (const clause of inClauses) {
-      if (!state.has(clause.key)) {
+      if (state.has(clause.key)) {
         state.set(clause.key, { included: new Set(), excluded: new Set() });
       }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: TypeError: Cannot read properties of undefined (reading 'included')

[Killed] BlockStatement
src/filters.ts:426:34
         state.set(clause.key, { included: new Set(), excluded: new Set() });
       }
       const sets = state.get(clause.key)!;
-      clause.values.forEach(v => {
-        if (clause.isExclude) {
-          sets.excluded.add(v);
-        } else {
-          sets.included.add(v);
-        }
-      });
+      clause.values.forEach(v => {});
     }
   }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/filters.ts:427:31
       }
       const sets = state.get(clause.key)!;
       clause.values.forEach(v => {
-        if (clause.isExclude) {
-          sets.excluded.add(v);
-        } else {
+        if (clause.isExclude) {} else {
           sets.included.add(v);
         }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: SeverityText NOT IN ('debug', 'trace') (NOT IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/filters.ts:427:13
       }
       const sets = state.get(clause.key)!;
       clause.values.forEach(v => {
-        if (clause.isExclude) {
+        if (false) {
           sets.excluded.add(v);
         } else {

[Killed] BlockStatement
src/filters.ts:429:16
       clause.values.forEach(v => {
         if (clause.isExclude) {
           sets.excluded.add(v);
-        } else {
-          sets.included.add(v);
-        }
+        } else {}
       });
     }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/filters.ts:442:18
 // conjuncts the pinned-filter parser silently drops.
 function countTopLevelAnd(condition: string): number {
   let count = 0;
-  let inString = false;
+  let inString = true;
   for (let i = 0; i < condition.length; i++) {
     if (isQuoteBoundary(condition, i)) {
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Duration BETWEEN 100 AND 5000 (BETWEEN (numeric))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/filters.ts:443:19
 function countTopLevelAnd(condition: string): number {
   let count = 0;
   let inString = false;
-  for (let i = 0; i < condition.length; i++) {
+  for (let i = 0; i >= condition.length; i++) {
     if (isQuoteBoundary(condition, i)) {
       if (inString) {
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Duration BETWEEN 100 AND 5000 (BETWEEN (numeric))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/filters.ts:443:46
 function countTopLevelAnd(condition: string): number {
   let count = 0;
   let inString = false;
-  for (let i = 0; i < condition.length; i++) {
-    if (isQuoteBoundary(condition, i)) {
-      if (inString) {
-        const esc = handleQuoteEscape(condition, i);
-        if (esc.skip) {
-          i = esc.next;
-          continue;
-        }
-      }
-      inString = !inString;
-      continue;
-    }
-    if (inString) continue;
-    if (condition.slice(i, i + 5).toUpperCase() === ' AND ') {
-      count++;
-      i += 4;
-    }
-  }
+  for (let i = 0; i < condition.length; i++) {}
   return count;
 }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Duration BETWEEN 100 AND 5000 (BETWEEN (numeric))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/filters.ts:444:9
   let count = 0;
   let inString = false;
   for (let i = 0; i < condition.length; i++) {
-    if (isQuoteBoundary(condition, i)) {
+    if (true) {
       if (inString) {
         const esc = handleQuoteEscape(condition, i);
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Duration BETWEEN 100 AND 5000 (BETWEEN (numeric))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/filters.ts:444:40
   let count = 0;
   let inString = false;
   for (let i = 0; i < condition.length; i++) {
-    if (isQuoteBoundary(condition, i)) {
-      if (inString) {
-        const esc = handleQuoteEscape(condition, i);
-        if (esc.skip) {
-          i = esc.next;
-          continue;
-        }
-      }
-      inString = !inString;
-      continue;
-    }
+    if (isQuoteBoundary(condition, i)) {}
     if (inString) continue;
     if (condition.slice(i, i + 5).toUpperCase() === ' AND ') {
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Body IN ('a AND b') (value containing AND)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/filters.ts:445:11
   let inString = false;
   for (let i = 0; i < condition.length; i++) {
     if (isQuoteBoundary(condition, i)) {
-      if (inString) {
+      if (true) {
         const esc = handleQuoteEscape(condition, i);
         if (esc.skip) {

[Killed] ConditionalExpression
src/filters.ts:456:9
       continue;
     }
     if (inString) continue;
-    if (condition.slice(i, i + 5).toUpperCase() === ' AND ') {
+    if (false) {
       count++;
       i += 4;
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Duration BETWEEN 100 AND 5000 (BETWEEN (numeric))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/filters.ts:456:9
       continue;
     }
     if (inString) continue;
-    if (condition.slice(i, i + 5).toUpperCase() === ' AND ') {
+    if (condition.slice(i, i + 5).toLowerCase() === ' AND ') {
       count++;
       i += 4;
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Duration BETWEEN 100 AND 5000 (BETWEEN (numeric))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] UpdateOperator
src/filters.ts:457:7
     }
     if (inString) continue;
     if (condition.slice(i, i + 5).toUpperCase() === ' AND ') {
-      count++;
+      count--;
       i += 4;
     }
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: Duration BETWEEN 100 AND 5000 (BETWEEN (numeric))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Timeout] AssignmentOperator
src/filters.ts:458:7
     if (inString) continue;
     if (condition.slice(i, i + 5).toUpperCase() === ' AND ') {
       count++;
-      i += 4;
+      i -= 4;
     }
   }

[Killed] BooleanLiteral
src/filters.ts:485:41
  * and executed but not shown (or only partially shown) in the UI.
  */
 export function isRenderablePinnedFilter(filter: Filter): boolean {
-  if (filter.type === 'sql_ast') return false;
+  if (filter.type === 'sql_ast') return true;
 
   const state = parseQuery([filter]).filters;
killedBy: filters isRenderablePinnedFilter rejects non-sql filter shapes (lucene, sql_ast)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/filters.ts:489:7
 
   const state = parseQuery([filter]).filters;
   const keys = Object.keys(state);
-  if (keys.length !== 1) return false;
+  if (keys.length === 1) return false;
 
   // A pinned-filter column key is a bare column expression. parseQuery's lenient
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/filters.ts:489:33
 
   const state = parseQuery([filter]).filters;
   const keys = Object.keys(state);
-  if (keys.length !== 1) return false;
+  if (keys.length !== 1) return true;
 
   // A pinned-filter column key is a bare column expression. parseQuery's lenient
killedBy: filters isRenderablePinnedFilter rejects ServiceName = 'checkout' (plain equality (never renders))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/filters.ts:498:51
   // executed predicate is the *inverse* of the facet the sidebar renders from
   // the same parse, so displayed and executed filters diverge. A real column key
   // never contains a bare NOT/AND/OR keyword, so reject when one appears.
-  if (/\b(?:NOT|AND|OR)\b/i.test(keys[0])) return false;
+  if (/\b(?:NOT|AND|OR)\b/i.test(keys[0])) return true;
 
   // filtersToQuery emits one clause per (column, kind); >1 means the condition
killedBy: filters isRenderablePinnedFilter rejects ServiceName NOT BETWEEN 1 AND 2 (NOT folded into the key (renders inverted))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/filters.ts:498:7
   // executed predicate is the *inverse* of the facet the sidebar renders from
   // the same parse, so displayed and executed filters diverge. A real column key
   // never contains a bare NOT/AND/OR keyword, so reject when one appears.
-  if (/\b(?:NOT|AND|OR)\b/i.test(keys[0])) return false;
+  if (false) return false;
 
   // filtersToQuery emits one clause per (column, kind); >1 means the condition
killedBy: filters isRenderablePinnedFilter rejects ServiceName NOT BETWEEN 1 AND 2 (NOT folded into the key (renders inverted))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/filters.ts:503:7
   // filtersToQuery emits one clause per (column, kind); >1 means the condition
   // resolved to multiple predicates (e.g. included + excluded on one column, or
   // a compound), which is not a single renderable facet.
-  if (filtersToQuery(state).length !== 1) return false;
+  if (filtersToQuery(state).length === 1) return false;
 
   // Catch conjuncts the parser dropped: a single IN/NOT IN has no top-level
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BooleanLiteral
src/filters.ts:503:50
   // filtersToQuery emits one clause per (column, kind); >1 means the condition
   // resolved to multiple predicates (e.g. included + excluded on one column, or
   // a compound), which is not a single renderable facet.
-  if (filtersToQuery(state).length !== 1) return false;
+  if (filtersToQuery(state).length !== 1) return true;
 
   // Catch conjuncts the parser dropped: a single IN/NOT IN has no top-level

[Killed] EqualityOperator
src/filters.ts:508:10
   // Catch conjuncts the parser dropped: a single IN/NOT IN has no top-level
   // AND, a single BETWEEN has exactly one (its own `min AND max`).
   const expectedAnds = state[keys[0]].range ? 1 : 0;
-  return countTopLevelAnd(filter.condition) === expectedAnds;
+  return countTopLevelAnd(filter.condition) !== expectedAnds;
 }
 
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/filters.ts:508:10
   // Catch conjuncts the parser dropped: a single IN/NOT IN has no top-level
   // AND, a single BETWEEN has exactly one (its own `min AND max`).
   const expectedAnds = state[keys[0]].range ? 1 : 0;
-  return countTopLevelAnd(filter.condition) === expectedAnds;
+  return false;
 }
 
killedBy: filters isRenderablePinnedFilter accepts a single renderable predicate: ServiceName IN ('checkout', 'payments') (IN)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/filters.ts:523:12
 const isParseableLucene = (condition: string): boolean => {
   try {
     parse(condition);
-    return true;
+    return false;
   } catch {
     return false;
killedBy: filters validateSavedFilterValues accepts a valid single-value lucene condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 7

- Array []
+ Array [
+   Object {

[Killed] StringLiteral
src/filters.ts:539:7
     const { sqlWithReplacements } = replaceJsonExpressions(condition);
     const sanitized = sqlWithReplacements.replace(
       MAP_OR_ARRAY_ACCESS_REGEX,
-      "''",
+      "",
     );
     new SQLParser.Parser().astify(`SELECT 1 FROM t WHERE ${sanitized}`, {
killedBy: filters validateSavedFilterValues accepts a valid sql condition over a map access column
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 7

- Array []
+ Array [
+   Object {

[Killed] StringLiteral
src/filters.ts:541:35
       MAP_OR_ARRAY_ACCESS_REGEX,
       "''",
     );
-    new SQLParser.Parser().astify(`SELECT 1 FROM t WHERE ${sanitized}`, {
+    new SQLParser.Parser().astify(``, {
       database: 'Postgresql',
     });
killedBy: filters validateSavedFilterValues flags a malformed sql condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "condition": "ServiceName = = ",

[Killed] StringLiteral
src/filters.ts:542:17
       "''",
     );
     new SQLParser.Parser().astify(`SELECT 1 FROM t WHERE ${sanitized}`, {
-      database: 'Postgresql',
+      database: "",
     });
     return true;
killedBy: filters validateSavedFilterValues accepts a valid sql condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 7

- Array []
+ Array [
+   Object {

[Killed] BooleanLiteral
src/filters.ts:559:7
   condition: string,
   language: 'lucene' | 'sql' | 'promql',
 ): boolean {
-  if (!condition.trim()) return true;
+  if (condition.trim()) return true;
   if (language === 'lucene') return isParseableLucene(condition);
   if (language === 'sql') return isParseableSql(condition);
killedBy: filters validateSavedFilterValues flags a malformed lucene condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "condition": "ServiceName:(((\"broken",

[Killed] ConditionalExpression
src/filters.ts:559:7
   condition: string,
   language: 'lucene' | 'sql' | 'promql',
 ): boolean {
-  if (!condition.trim()) return true;
+  if (true) return true;
   if (language === 'lucene') return isParseableLucene(condition);
   if (language === 'sql') return isParseableSql(condition);
killedBy: filters validateSavedFilterValues flags a malformed lucene condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "condition": "ServiceName:(((\"broken",

[Killed] ConditionalExpression
src/filters.ts:560:7
   language: 'lucene' | 'sql' | 'promql',
 ): boolean {
   if (!condition.trim()) return true;
-  if (language === 'lucene') return isParseableLucene(condition);
+  if (false) return isParseableLucene(condition);
   if (language === 'sql') return isParseableSql(condition);
   return true;
killedBy: filters validateSavedFilterValues flags a malformed lucene condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "condition": "ServiceName:(((\"broken",

[Killed] ConditionalExpression
src/filters.ts:560:7
   language: 'lucene' | 'sql' | 'promql',
 ): boolean {
   if (!condition.trim()) return true;
-  if (language === 'lucene') return isParseableLucene(condition);
+  if (true) return isParseableLucene(condition);
   if (language === 'sql') return isParseableSql(condition);
   return true;
killedBy: filters validateSavedFilterValues accepts a valid sql condition over a map access column
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 7

- Array []
+ Array [
+   Object {

[Killed] ConditionalExpression
src/filters.ts:561:7
 ): boolean {
   if (!condition.trim()) return true;
   if (language === 'lucene') return isParseableLucene(condition);
-  if (language === 'sql') return isParseableSql(condition);
+  if (false) return isParseableSql(condition);
   return true;
 }
killedBy: filters validateSavedFilterValues flags a malformed sql condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "condition": "ServiceName = = ",

[Killed] EqualityOperator
src/filters.ts:561:7
 ): boolean {
   if (!condition.trim()) return true;
   if (language === 'lucene') return isParseableLucene(condition);
-  if (language === 'sql') return isParseableSql(condition);
+  if (language !== 'sql') return isParseableSql(condition);
   return true;
 }
killedBy: filters validateSavedFilterValues flags a malformed sql condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "condition": "ServiceName = = ",

[NoCoverage] BooleanLiteral
src/filters.ts:562:10
   if (!condition.trim()) return true;
   if (language === 'lucene') return isParseableLucene(condition);
   if (language === 'sql') return isParseableSql(condition);
-  return true;
+  return false;
 }
 

[Killed] BlockStatement
src/filters.ts:581:38
   filters: Filter[],
 ): SavedFilterValueIssue[] {
   const issues: SavedFilterValueIssue[] = [];
-  filters.forEach((filter, index) => {
-    if (filter.type !== 'lucene' && filter.type !== 'sql') return;
-    const condition = filter.condition;
-    if (!condition.trim()) return;
-    if (!isValidFilterCondition(condition, filter.type)) {
-      issues.push({ index, language: filter.type, condition });
-    }
-  });
+  filters.forEach((filter, index) => {});
   return issues;
 }
killedBy: filters validateSavedFilterValues flags a malformed lucene condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "condition": "ServiceName:(((\"broken",

[Killed] ConditionalExpression
src/filters.ts:582:9
 ): SavedFilterValueIssue[] {
   const issues: SavedFilterValueIssue[] = [];
   filters.forEach((filter, index) => {
-    if (filter.type !== 'lucene' && filter.type !== 'sql') return;
+    if (true && filter.type !== 'sql') return;
     const condition = filter.condition;
     if (!condition.trim()) return;
killedBy: filters validateSavedFilterValues flags a malformed lucene condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "condition": "ServiceName:(((\"broken",

[Killed] ConditionalExpression
src/filters.ts:582:37
 ): SavedFilterValueIssue[] {
   const issues: SavedFilterValueIssue[] = [];
   filters.forEach((filter, index) => {
-    if (filter.type !== 'lucene' && filter.type !== 'sql') return;
+    if (filter.type !== 'lucene' && true) return;
     const condition = filter.condition;
     if (!condition.trim()) return;
killedBy: filters validateSavedFilterValues flags a malformed sql condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "condition": "ServiceName = = ",

[Killed] BooleanLiteral
src/filters.ts:584:9
   filters.forEach((filter, index) => {
     if (filter.type !== 'lucene' && filter.type !== 'sql') return;
     const condition = filter.condition;
-    if (!condition.trim()) return;
+    if (condition.trim()) return;
     if (!isValidFilterCondition(condition, filter.type)) {
       issues.push({ index, language: filter.type, condition });
killedBy: filters validateSavedFilterValues flags a malformed lucene condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "condition": "ServiceName:(((\"broken",

[Survived] MethodExpression
src/filters.ts:584:10
   filters.forEach((filter, index) => {
     if (filter.type !== 'lucene' && filter.type !== 'sql') return;
     const condition = filter.condition;
-    if (!condition.trim()) return;
+    if (!condition) return;
     if (!isValidFilterCondition(condition, filter.type)) {
       issues.push({ index, language: filter.type, condition });

[Killed] BooleanLiteral
src/filters.ts:585:9
     if (filter.type !== 'lucene' && filter.type !== 'sql') return;
     const condition = filter.condition;
     if (!condition.trim()) return;
-    if (!isValidFilterCondition(condition, filter.type)) {
+    if (isValidFilterCondition(condition, filter.type)) {
       issues.push({ index, language: filter.type, condition });
     }
killedBy: filters validateSavedFilterValues accepts a valid single-value lucene condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 7

- Array []
+ Array [
+   Object {

[Killed] ConditionalExpression
src/filters.ts:585:9
     if (filter.type !== 'lucene' && filter.type !== 'sql') return;
     const condition = filter.condition;
     if (!condition.trim()) return;
-    if (!isValidFilterCondition(condition, filter.type)) {
+    if (true) {
       issues.push({ index, language: filter.type, condition });
     }
killedBy: filters validateSavedFilterValues accepts a valid single-value lucene condition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 7

- Array []
+ Array [
+   Object {

[Survived] MethodExpression
src/filters.ts:617:8
   savedQuery: string | null | undefined,
   language: 'lucene' | 'sql' | 'promql' | null | undefined,
 ): SavedQueryIssue | null {
-  if (!savedQuery?.trim()) return null;
+  if (!savedQuery) return null;
   const lang = language ?? 'lucene';
   if (lang !== 'lucene' && lang !== 'sql') return null;

[Killed] ConditionalExpression
src/filters.ts:619:7
 ): SavedQueryIssue | null {
   if (!savedQuery?.trim()) return null;
   const lang = language ?? 'lucene';
-  if (lang !== 'lucene' && lang !== 'sql') return null;
+  if (true && lang !== 'sql') return null;
   if (isValidFilterCondition(savedQuery, lang)) return null;
   return { language: lang, query: savedQuery };
killedBy: filters validateSavedQuery defaults a missing language to lucene
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"language": "lucene", "query": "Bad:(((\""}
Received: null

[Killed] ConditionalExpression
src/filters.ts:619:28
 ): SavedQueryIssue | null {
   if (!savedQuery?.trim()) return null;
   const lang = language ?? 'lucene';
-  if (lang !== 'lucene' && lang !== 'sql') return null;
+  if (lang !== 'lucene' && true) return null;
   if (isValidFilterCondition(savedQuery, lang)) return null;
   return { language: lang, query: savedQuery };
killedBy: filters validateSavedQuery flags a malformed sql query
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"language": "sql", "query": "ServiceName = = "}
Received: null

[Killed] ConditionalExpression
src/filters.ts:620:7
   if (!savedQuery?.trim()) return null;
   const lang = language ?? 'lucene';
   if (lang !== 'lucene' && lang !== 'sql') return null;
-  if (isValidFilterCondition(savedQuery, lang)) return null;
+  if (false) return null;
   return { language: lang, query: savedQuery };
 }
killedBy: filters validateSavedQuery accepts a valid lucene query
statusReason: Error: expect(received).toBeNull()

Received: {"language": "lucene", "query": "ServiceName:\"api\""}
