[Killed] BlockStatement
src/filters.ts:652:33
   filters: DashboardFilter[],
 ): DashboardFilterQueryIssue[] {
   const issues: DashboardFilterQueryIssue[] = [];
-  for (const filter of filters) {
-    const where = filter.where ?? '';
-    if (!where.trim()) continue;
-    const language = filter.whereLanguage ?? 'sql';
-    if (language !== 'lucene' && language !== 'sql') continue;
-    if (!isValidFilterCondition(where, language)) {
-      issues.push({
-        filterId: filter.id,
-        filterName: filter.name,
-        language,
-        where,
-      });
-    }
-  }
+  for (const filter of filters) {}
   return issues;
 }
killedBy: filters validateDashboardFilterQueries flags a malformed lucene where clause
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Object {
-     "filterId": "svc",

[Killed] BooleanLiteral
src/filters.ts:654:9
   const issues: DashboardFilterQueryIssue[] = [];
   for (const filter of filters) {
     const where = filter.where ?? '';
-    if (!where.trim()) continue;
+    if (where.trim()) continue;
     const language = filter.whereLanguage ?? 'sql';
     if (language !== 'lucene' && language !== 'sql') continue;
killedBy: filters validateDashboardFilterQueries flags a malformed lucene where clause
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Object {
-     "filterId": "svc",

[Killed] ConditionalExpression
src/filters.ts:654:9
   const issues: DashboardFilterQueryIssue[] = [];
   for (const filter of filters) {
     const where = filter.where ?? '';
-    if (!where.trim()) continue;
+    if (true) continue;
     const language = filter.whereLanguage ?? 'sql';
     if (language !== 'lucene' && language !== 'sql') continue;
killedBy: filters validateDashboardFilterQueries flags a malformed lucene where clause
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Object {
-     "filterId": "svc",

[NoCoverage] StringLiteral
src/filters.ts:655:46
   for (const filter of filters) {
     const where = filter.where ?? '';
     if (!where.trim()) continue;
-    const language = filter.whereLanguage ?? 'sql';
+    const language = filter.whereLanguage ?? "";
     if (language !== 'lucene' && language !== 'sql') continue;
     if (!isValidFilterCondition(where, language)) {

[Killed] ConditionalExpression
src/filters.ts:656:9
     const where = filter.where ?? '';
     if (!where.trim()) continue;
     const language = filter.whereLanguage ?? 'sql';
-    if (language !== 'lucene' && language !== 'sql') continue;
+    if (true) continue;
     if (!isValidFilterCondition(where, language)) {
       issues.push({
killedBy: filters validateDashboardFilterQueries flags a malformed lucene where clause
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Object {
-     "filterId": "svc",

[Killed] ConditionalExpression
src/filters.ts:656:9
     const where = filter.where ?? '';
     if (!where.trim()) continue;
     const language = filter.whereLanguage ?? 'sql';
-    if (language !== 'lucene' && language !== 'sql') continue;
+    if (true && language !== 'sql') continue;
     if (!isValidFilterCondition(where, language)) {
       issues.push({
killedBy: filters validateDashboardFilterQueries flags a malformed lucene where clause
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Object {
-     "filterId": "svc",

[Killed] BlockStatement
src/filters.ts:657:51
     if (!where.trim()) continue;
     const language = filter.whereLanguage ?? 'sql';
     if (language !== 'lucene' && language !== 'sql') continue;
-    if (!isValidFilterCondition(where, language)) {
-      issues.push({
-        filterId: filter.id,
-        filterName: filter.name,
-        language,
-        where,
-      });
-    }
+    if (!isValidFilterCondition(where, language)) {}
   }
   return issues;
killedBy: filters validateDashboardFilterQueries flags a malformed lucene where clause
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Object {
-     "filterId": "svc",

[Killed] ConditionalExpression
src/filters.ts:657:9
     if (!where.trim()) continue;
     const language = filter.whereLanguage ?? 'sql';
     if (language !== 'lucene' && language !== 'sql') continue;
-    if (!isValidFilterCondition(where, language)) {
+    if (false) {
       issues.push({
         filterId: filter.id,
killedBy: filters validateDashboardFilterQueries flags a malformed lucene where clause
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Object {
-     "filterId": "svc",
