[Killed] ConditionalExpression
src/guards.ts:43:10
 export function isRawSqlChartConfig(
   chartConfig: ChartConfig | ChartConfigWithOptDateRange,
 ): chartConfig is RawSqlChartConfig {
-  return 'configType' in chartConfig && chartConfig.configType === 'sql';
+  return true;
 }
 
killedBy: renderBuilderConfigAsSqlTemplate generates a macro-based template for a line chart with group-by and lucene where
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
src/guards.ts:43:10
 export function isRawSqlChartConfig(
   chartConfig: ChartConfig | ChartConfigWithOptDateRange,
 ): chartConfig is RawSqlChartConfig {
-  return 'configType' in chartConfig && chartConfig.configType === 'sql';
+  return false;
 }
 
killedBy: renderChartConfig returns sqlTemplate verbatim for raw sql config
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/guards.ts:49:10
 export function isPromqlChartConfig(
   chartConfig: ChartConfig | ChartConfigWithOptDateRange,
 ): chartConfig is PromqlChartConfig {
-  return 'configType' in chartConfig && chartConfig.configType === 'promql';
+  return false;
 }
 
killedBy: renderChartConfig PromQL chart config should return empty SQL (PromQL is executed via Prometheus API)
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/guards.ts:49:10
 export function isPromqlChartConfig(
   chartConfig: ChartConfig | ChartConfigWithOptDateRange,
 ): chartConfig is PromqlChartConfig {
-  return 'configType' in chartConfig && chartConfig.configType === 'promql';
+  return true;
 }
 
killedBy: renderChartConfig should generate sql for a single gauge metric
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `renderChartConfig should generate sql for a single gauge metric 1`

- Snapshot  - 28
+ Received  +  0

- WITH Source AS (

[Killed] LogicalOperator
src/guards.ts:55:10
 export function isBuilderChartConfig(
   chartConfig: ChartConfig | ChartConfigWithOptDateRange,
 ): chartConfig is BuilderChartConfig {
-  return !isRawSqlChartConfig(chartConfig) && !isPromqlChartConfig(chartConfig);
+  return !isRawSqlChartConfig(chartConfig) || !isPromqlChartConfig(chartConfig);
 }
 
killedBy: Metadata getKeyValues renders JSON attribute keys as typed subcolumns
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/guards.ts:55:10
 export function isBuilderChartConfig(
   chartConfig: ChartConfig | ChartConfigWithOptDateRange,
 ): chartConfig is BuilderChartConfig {
-  return !isRawSqlChartConfig(chartConfig) && !isPromqlChartConfig(chartConfig);
+  return false;
 }
 
killedBy: Metadata getKeyValues renders JSON attribute keys as typed subcolumns
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/guards.ts:61:10
 export function isRawSqlSavedChartConfig(
   chartConfig: SavedChartConfig,
 ): chartConfig is RawSqlSavedChartConfig {
-  return 'configType' in chartConfig && chartConfig.configType === 'sql';
+  return true;
 }
 
killedBy: utils convertToDashboardTemplate should convert a dashboard to a dashboard template
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

@@ -1,15 +1,17 @@
  Object {
    "filters": Array [

[Killed] EqualityOperator
src/guards.ts:61:41
 export function isRawSqlSavedChartConfig(
   chartConfig: SavedChartConfig,
 ): chartConfig is RawSqlSavedChartConfig {
-  return 'configType' in chartConfig && chartConfig.configType === 'sql';
+  return 'configType' in chartConfig && chartConfig.configType !== 'sql';
 }
 
killedBy: utils convertToDashboardTemplate should convert connection IDs to names for RawSQL tiles
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "configType": "sql",
-   "connection": "Production DB",

[Killed] ConditionalExpression
src/guards.ts:67:10
 export function isPromqlSavedChartConfig(
   chartConfig: SavedChartConfig,
 ): chartConfig is PromqlSavedChartConfig {
-  return 'configType' in chartConfig && chartConfig.configType === 'promql';
+  return true;
 }
 
killedBy: utils convertToDashboardTemplate should convert a dashboard to a dashboard template
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 4

@@ -1,15 +1,17 @@
  Object {
    "filters": Array [

[NoCoverage] EqualityOperator
src/guards.ts:67:41
 export function isPromqlSavedChartConfig(
   chartConfig: SavedChartConfig,
 ): chartConfig is PromqlSavedChartConfig {
-  return 'configType' in chartConfig && chartConfig.configType === 'promql';
+  return 'configType' in chartConfig && chartConfig.configType !== 'promql';
 }
 

[Killed] BooleanLiteral
src/guards.ts:74:5
   chartConfig: SavedChartConfig,
 ): chartConfig is BuilderSavedChartConfig {
   return (
-    !isRawSqlSavedChartConfig(chartConfig) &&
+    isRawSqlSavedChartConfig(chartConfig) &&
     !isPromqlSavedChartConfig(chartConfig)
   );
killedBy: utils convertToDashboardTemplate should convert a dashboard to a dashboard template
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 4

@@ -1,15 +1,17 @@
  Object {
    "filters": Array [

[Killed] ConditionalExpression
src/guards.ts:74:5
   chartConfig: SavedChartConfig,
 ): chartConfig is BuilderSavedChartConfig {
   return (
-    !isRawSqlSavedChartConfig(chartConfig) &&
-    !isPromqlSavedChartConfig(chartConfig)
+    true
   );
 }
killedBy: utils convertToDashboardTemplate should convert connection IDs to names for RawSQL tiles
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "configType": "sql",
-   "connection": "Production DB",

[Killed] BooleanLiteral
src/guards.ts:75:5
 ): chartConfig is BuilderSavedChartConfig {
   return (
     !isRawSqlSavedChartConfig(chartConfig) &&
-    !isPromqlSavedChartConfig(chartConfig)
+    isPromqlSavedChartConfig(chartConfig)
   );
 }
killedBy: utils convertToDashboardTemplate should convert a dashboard to a dashboard template
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 4

@@ -1,15 +1,17 @@
  Object {
    "filters": Array [

[Killed] EqualityOperator
src/guards.ts:88:10
 export function displayTypeRequiresSource(
   displayType: DisplayType | undefined,
 ): boolean {
-  return displayType !== DisplayType.Markdown;
+  return displayType === DisplayType.Markdown;
 }
 
killedBy: displayTypeRequiresSource returns false for Markdown
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/guards.ts:88:10
 export function displayTypeRequiresSource(
   displayType: DisplayType | undefined,
 ): boolean {
-  return displayType !== DisplayType.Markdown;
+  return true;
 }
 
killedBy: displayTypeRequiresSource returns false for Markdown
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
