[Killed] BlockStatement
src/macros.ts:14:3
   args: string[],
   minArgs: number,
   maxArgs: number,
-) {
-  if (args.length < minArgs || args.length > maxArgs) {
-    const expected =
-      minArgs === maxArgs ? `${minArgs}` : `${minArgs}-${maxArgs}`;
-    throw new Error(
-      `Macro '${macroName}' expects ${expected} argument(s), but got ${args.length}`,
-    );
-  }
-}
+) {}
 
 // Helpers to render ClickHouse time conversions using query params
killedBy: replaceMacros should throw on wrong argument count
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "expects 1 argument(s), but got 2"

Received function did not throw

[Killed] BlockStatement
src/macros.ts:15:55
   minArgs: number,
   maxArgs: number,
 ) {
-  if (args.length < minArgs || args.length > maxArgs) {
-    const expected =
-      minArgs === maxArgs ? `${minArgs}` : `${minArgs}-${maxArgs}`;
-    throw new Error(
-      `Macro '${macroName}' expects ${expected} argument(s), but got ${args.length}`,
-    );
-  }
+  if (args.length < minArgs || args.length > maxArgs) {}
 }
 
killedBy: replaceMacros should throw on wrong argument count
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "expects 1 argument(s), but got 2"

Received function did not throw

[Killed] EqualityOperator
src/macros.ts:15:7
   minArgs: number,
   maxArgs: number,
 ) {
-  if (args.length < minArgs || args.length > maxArgs) {
+  if (args.length <= minArgs || args.length > maxArgs) {
     const expected =
       minArgs === maxArgs ? `${minArgs}` : `${minArgs}-${maxArgs}`;
killedBy: renderChartConfig raw sql macro replacement replaces $__dateFilter macro in raw sql config
statusReason: Error: Macro 'dateFilter' expects 1 argument(s), but got 1

[Killed] EqualityOperator
src/macros.ts:17:7
 ) {
   if (args.length < minArgs || args.length > maxArgs) {
     const expected =
-      minArgs === maxArgs ? `${minArgs}` : `${minArgs}-${maxArgs}`;
+      minArgs !== maxArgs ? `${minArgs}` : `${minArgs}-${maxArgs}`;
     throw new Error(
       `Macro '${macroName}' expects ${expected} argument(s), but got ${args.length}`,
killedBy: replaceMacros should throw on wrong argument count
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "expects 1 argument(s), but got 2"
Received message:   "Macro 'timeFilter' expects 1-1 argument(s), but got 2"

      60 |         stryCov_9fa48("686");
    > 62 |         throw new Error(stryMutAct_9fa48("692") ? `` : (stryCov_9fa48("692"), `Macro '${macroName}' expects ${expected} argument(s), but got ${args.length}`));

[Killed] ConditionalExpression
src/macros.ts:17:7
 ) {
   if (args.length < minArgs || args.length > maxArgs) {
     const expected =
-      minArgs === maxArgs ? `${minArgs}` : `${minArgs}-${maxArgs}`;
+      true ? `${minArgs}` : `${minArgs}-${maxArgs}`;
     throw new Error(
       `Macro '${macroName}' expects ${expected} argument(s), but got ${args.length}`,
killedBy: replaceMacros should throw when $__sourceTable is called with too many arguments
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "expects 0-1 argument(s), but got 2"
Received message:   "Macro 'sourceTable' expects 0 argument(s), but got 2"

      60 |         stryCov_9fa48("686");
    > 62 |         throw new Error(stryMutAct_9fa48("692") ? `` : (stryCov_9fa48("692"), `Macro '${macroName}' expects ${expected} argument(s), but got ${args.length}`));

[Killed] StringLiteral
src/macros.ts:77:14
     replace: (args: string[]) => {
       expectArgs('timeFilter', args, 1, 1);
       const [col] = args;
-      return `${col} >= ${timeToDateTime(startMs())} AND ${col} <= ${timeToDateTime(endMs())}`;
+      return ``;
     },
   },
killedBy: renderChartConfig raw sql macro replacement replaces $__timeFilter macro in raw sql config
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SELECT * FROM logs WHERE ts >= toDateTime(fromUnixTimestamp64Milli({startDateMilliseconds:Int64})) AND ts <= toDateTime(fromUnixTimestamp64Milli({endDateMilliseconds:Int64}))"
Received: "SELECT * FROM logs WHERE "

[Survived] StringLiteral
src/macros.ts:95:18
     minArgs: 1,
     maxArgs: 1,
     replace: (args: string[]) => {
-      expectArgs('dateFilter', args, 1, 1);
+      expectArgs("", args, 1, 1);
       const [col] = args;
       return `${col} >= ${timeToDate(startMs())} AND ${col} <= ${timeToDate(endMs())}`;

[Killed] StringLiteral
src/macros.ts:107:26
     replace: (args: string[]) => {
       expectArgs('dateTimeFilter', args, 2, 2);
       const [dateCol, timeCol] = args;
-      const dateFilter = `(${dateCol} >= ${timeToDate(startMs())} AND ${dateCol} <= ${timeToDate(endMs())})`;
+      const dateFilter = ``;
       const timeFilter = `(${timeCol} >= ${timeToDateTime(startMs())} AND ${timeCol} <= ${timeToDateTime(endMs())})`;
       return `${dateFilter} AND ${timeFilter}`;
killedBy: renderChartConfig raw sql macro replacement replaces $__dateTimeFilter macro in raw sql config
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "SELECT * FROM logs WHERE  AND (ts >= toDateTime(fromUnixTimestamp64Milli({startDateMilliseconds:Int64})) AND ts <= toDateTime(fromUnixTimestamp64Milli({endDateMilliseconds:Int64})))"

[Survived] StringLiteral
src/macros.ts:129:18
     minArgs: 1,
     maxArgs: 1,
     replace: (args: string[]) => {
-      expectArgs('timeInterval', args, 1, 1);
+      expectArgs("", args, 1, 1);
       const [col] = args;
       return `toStartOfInterval(toDateTime(${col}), INTERVAL ${intervalS()} second)`;

[Killed] StringLiteral
src/macros.ts:141:14
     replace: (args: string[]) => {
       expectArgs('timeInterval_ms', args, 1, 1);
       const [col] = args;
-      return `toStartOfInterval(toDateTime64(${col}, 3), INTERVAL ${intervalMs()} millisecond)`;
+      return ``;
     },
   },
killedBy: replaceMacros should replace $__timeInterval_ms with millisecond interval bucketing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SELECT toStartOfInterval(toDateTime64(ts, 3), INTERVAL {intervalMilliseconds:Int64} millisecond)"
Received: "SELECT "

[Killed] MethodExpression
src/macros.ts:211:8
 };
 
 function parseMacroArgs(argString: string): { args: string[]; length: number } {
-  if (!argString.startsWith('(')) {
+  if (!argString.endsWith('(')) {
     return { args: [], length: 0 };
   }
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Macro 'timeInterval' expects 1 argument(s), but got 0

[Killed] BlockStatement
src/macros.ts:211:35
 };
 
 function parseMacroArgs(argString: string): { args: string[]; length: number } {
-  if (!argString.startsWith('(')) {
-    return { args: [], length: 0 };
-  }
+  if (!argString.startsWith('(')) {}
 
   // Find the matching close paren
killedBy: renderBuilderConfigAsSqlTemplate round-trips through replaceMacros into an executable, alert-valid query
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "{startDateMilliseconds:Int64}"
Received string:    "SELECT
  count(),
  ServiceName,
  toStartOfInterval(toDateTime(timestamp), INTERVAL {intervalSeconds:Int64} second) AS `__hdx_time_bucket`
FROM

[Killed] ArrayDeclaration
src/macros.ts:212:20
 
 function parseMacroArgs(argString: string): { args: string[]; length: number } {
   if (!argString.startsWith('(')) {
-    return { args: [], length: 0 };
+    return { args: ["Stryker was here"], length: 0 };
   }
 
killedBy: renderBuilderConfigAsSqlTemplate round-trips through replaceMacros into an executable, alert-valid query
statusReason: Error: Macro '$__sourceTable(metricType)' with a metric type argument requires a metrics source to be selected

[Killed] UnaryOperator
src/macros.ts:217:25
 
   // Find the matching close paren
   let unmatchedParens = 0;
-  let closeParenIndex = -1;
+  let closeParenIndex = +1;
   for (let i = 0; i < argString.length; i++) {
     const c = argString.charAt(i);
killedBy: replaceMacros should throw on missing close bracket
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Failed to parse macro arguments"
Received message:   "Macro 'timeFilter' expects 1 argument(s), but got 0"

      60 |         stryCov_9fa48("686");
    > 62 |         throw new Error(stryMutAct_9fa48("692") ? `` : (stryCov_9fa48("692"), `Macro '${macroName}' expects ${expected} argument(s), but got ${args.length}`));

[Killed] EqualityOperator
src/macros.ts:218:19
   // Find the matching close paren
   let unmatchedParens = 0;
   let closeParenIndex = -1;
-  for (let i = 0; i < argString.length; i++) {
+  for (let i = 0; i >= argString.length; i++) {
     const c = argString.charAt(i);
     if (c === '(') {
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Failed to parse macro arguments

[Killed] BlockStatement
src/macros.ts:218:46
   // Find the matching close paren
   let unmatchedParens = 0;
   let closeParenIndex = -1;
-  for (let i = 0; i < argString.length; i++) {
-    const c = argString.charAt(i);
-    if (c === '(') {
-      unmatchedParens++;
-    } else if (c === ')') {
-      unmatchedParens--;
-      if (unmatchedParens === 0) {
-        closeParenIndex = i;
-        break;
-      }
-    }
-  }
+  for (let i = 0; i < argString.length; i++) {}
 
   if (closeParenIndex < 0) {
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Failed to parse macro arguments

[Killed] MethodExpression
src/macros.ts:219:15
   let unmatchedParens = 0;
   let closeParenIndex = -1;
   for (let i = 0; i < argString.length; i++) {
-    const c = argString.charAt(i);
+    const c = argString;
     if (c === '(') {
       unmatchedParens++;
killedBy: renderChartConfig raw sql macro replacement replaces $__dateFilter macro in raw sql config
statusReason: Error: Failed to parse macro arguments

[Killed] BlockStatement
src/macros.ts:220:20
   let closeParenIndex = -1;
   for (let i = 0; i < argString.length; i++) {
     const c = argString.charAt(i);
-    if (c === '(') {
-      unmatchedParens++;
-    } else if (c === ')') {
+    if (c === '(') {} else if (c === ')') {
       unmatchedParens--;
       if (unmatchedParens === 0) {
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Failed to parse macro arguments

[Killed] ConditionalExpression
src/macros.ts:220:9
   let closeParenIndex = -1;
   for (let i = 0; i < argString.length; i++) {
     const c = argString.charAt(i);
-    if (c === '(') {
+    if (true) {
       unmatchedParens++;
     } else if (c === ')') {
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Failed to parse macro arguments

[Killed] UpdateOperator
src/macros.ts:221:7
   for (let i = 0; i < argString.length; i++) {
     const c = argString.charAt(i);
     if (c === '(') {
-      unmatchedParens++;
+      unmatchedParens--;
     } else if (c === ')') {
       unmatchedParens--;
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Failed to parse macro arguments

[Killed] EqualityOperator
src/macros.ts:222:16
     const c = argString.charAt(i);
     if (c === '(') {
       unmatchedParens++;
-    } else if (c === ')') {
+    } else if (c !== ')') {
       unmatchedParens--;
       if (unmatchedParens === 0) {
killedBy: renderChartConfig raw sql macro replacement replaces $__dateFilter macro in raw sql config
statusReason: Error: Macro 'dateFilter' expects 1 argument(s), but got 0

[Killed] ConditionalExpression
src/macros.ts:222:16
     const c = argString.charAt(i);
     if (c === '(') {
       unmatchedParens++;
-    } else if (c === ')') {
+    } else if (false) {
       unmatchedParens--;
       if (unmatchedParens === 0) {
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Failed to parse macro arguments

[Killed] UpdateOperator
src/macros.ts:223:7
     if (c === '(') {
       unmatchedParens++;
     } else if (c === ')') {
-      unmatchedParens--;
+      unmatchedParens++;
       if (unmatchedParens === 0) {
         closeParenIndex = i;
killedBy: renderChartConfig raw sql macro replacement replaces $__dateFilter macro in raw sql config
statusReason: Error: Failed to parse macro arguments

[Killed] ConditionalExpression
src/macros.ts:224:11
       unmatchedParens++;
     } else if (c === ')') {
       unmatchedParens--;
-      if (unmatchedParens === 0) {
+      if (false) {
         closeParenIndex = i;
         break;
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Failed to parse macro arguments

[Killed] EqualityOperator
src/macros.ts:224:11
       unmatchedParens++;
     } else if (c === ')') {
       unmatchedParens--;
-      if (unmatchedParens === 0) {
+      if (unmatchedParens !== 0) {
         closeParenIndex = i;
         break;
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Failed to parse macro arguments

[Killed] EqualityOperator
src/macros.ts:231:7
     }
   }
 
-  if (closeParenIndex < 0) {
+  if (closeParenIndex >= 0) {
     return { args: [], length: -1 };
   }
killedBy: renderChartConfig raw sql macro replacement replaces $__dateFilter macro in raw sql config
statusReason: Error: Failed to parse macro arguments

[Killed] ConditionalExpression
src/macros.ts:231:7
     }
   }
 
-  if (closeParenIndex < 0) {
+  if (false) {
     return { args: [], length: -1 };
   }
killedBy: replaceMacros should throw on missing close bracket
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Failed to parse macro arguments"

Received function did not throw

[Killed] UnaryOperator
src/macros.ts:232:32
   }
 
   if (closeParenIndex < 0) {
-    return { args: [], length: -1 };
+    return { args: [], length: +1 };
   }
 
killedBy: replaceMacros should throw on missing close bracket
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Failed to parse macro arguments"
Received message:   "Macro 'timeFilter' expects 1 argument(s), but got 0"

      60 |         stryCov_9fa48("686");
    > 62 |         throw new Error(stryMutAct_9fa48("692") ? `` : (stryCov_9fa48("692"), `Macro '${macroName}' expects ${expected} argument(s), but got ${args.length}`));

[Survived] ArrayDeclaration
src/macros.ts:232:20
   }
 
   if (closeParenIndex < 0) {
-    return { args: [], length: -1 };
+    return { args: ["Stryker was here"], length: -1 };
   }
 

[Killed] MethodExpression
src/macros.ts:235:17
     return { args: [], length: -1 };
   }
 
-  const inner = argString.slice(1, closeParenIndex);
+  const inner = argString;
   const args = splitAndTrimWithBracket(inner);
   return { args, length: closeParenIndex + 1 };
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Macro 'timeInterval' expects 1 argument(s), but got 17

[Killed] ArithmeticOperator
src/macros.ts:237:26
 
   const inner = argString.slice(1, closeParenIndex);
   const args = splitAndTrimWithBracket(inner);
-  return { args, length: closeParenIndex + 1 };
+  return { args, length: closeParenIndex - 1 };
 }
 
killedBy: replaceMacros should replace $__timeFilter with seconds-precision range filter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "WHERE ts >= toDateTime(fromUnixTimestamp64Milli({startDateMilliseconds:Int64})) AND ts <= toDateTime(fromUnixTimestamp64Milli({endDateMilliseconds:Int64}))"
Received: "WHERE ts >= toDateTime(fromUnixTimestamp64Milli({startDateMilliseconds:Int64})) AND ts <= toDateTime(fromUnixTimestamp64Milli({endDateMilliseconds:Int64}))s)"

[Killed] ConditionalExpression
src/macros.ts:244:10
  * True if the SQL contains at least one occurrence of the `$__<name>` macro.
  */
 export function hasMacro(sql: string, name: string): boolean {
-  return findMacros(sql, name).length > 0;
+  return false;
 }
 
killedBy: hasMacro detects a $__filters macro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/macros.ts:244:10
  * True if the SQL contains at least one occurrence of the `$__<name>` macro.
  */
 export function hasMacro(sql: string, name: string): boolean {
-  return findMacros(sql, name).length > 0;
+  return true;
 }
 
killedBy: hasMacro returns false when the macro is absent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/macros.ts:255:41
 export function getSourceDependentMacrosUsed(
   sqlTemplate: string,
 ): (typeof SOURCE_DEPENDENT_MACROS)[number][] {
-  return SOURCE_DEPENDENT_MACROS.filter(macro => hasMacro(sqlTemplate, macro));
+  return SOURCE_DEPENDENT_MACROS.filter(() => undefined);
 }
 
killedBy: getSourceDependentMacrosUsed detects $__filters
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "filters",
- ]

[Killed] StringLiteral
src/macros.ts:263:34
  * bare `$__sourceTable`, 1 for `$__sourceTable(<metricType>)`.
  */
 export function getSourceTableMacroArgCounts(sqlTemplate: string): number[] {
-  return findMacros(sqlTemplate, 'sourceTable').map(match => match.args.length);
+  return findMacros(sqlTemplate, "").map(match => match.args.length);
 }
 
killedBy: validateRawSqlChartConfig silently skips that same interval error when metricTables is missing, but still reports the source-type mismatch
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "SQL uses $__sourceTable(<metricType>) but the selected source is not a metrics source — use a bare $__sourceTable instead.",
- ]

[Killed] BlockStatement
src/macros.ts:271:48
   const pattern = new RegExp(`\\$__${name}\\b`, 'g');
   const matches: MacroMatch[] = [];
 
-  for (const match of input.matchAll(pattern)) {
-    const start = match.index!;
-    const end = start + match[0].length;
-    const { args, length } = parseMacroArgs(input.slice(end));
-
-    if (length < 0) {
-      throw new Error('Failed to parse macro arguments');
-    }
-
-    matches.push({ full: input.slice(start, end + length), args });
-  }
+  for (const match of input.matchAll(pattern)) {}
 
   return matches;
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "$__"
Received string:        "WITH
  Source AS (
    SELECT
      *,
      cityHash64(ScopeAttributes, ResourceAttributes, Attributes) AS AttributesHash

[Killed] ArithmeticOperator
src/macros.ts:273:17
 
   for (const match of input.matchAll(pattern)) {
     const start = match.index!;
-    const end = start + match[0].length;
+    const end = start - match[0].length;
     const { args, length } = parseMacroArgs(input.slice(end));
 
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Macro 'timeInterval' expects 1 argument(s), but got 0

[Killed] MethodExpression
src/macros.ts:274:45
   for (const match of input.matchAll(pattern)) {
     const start = match.index!;
     const end = start + match[0].length;
-    const { args, length } = parseMacroArgs(input.slice(end));
+    const { args, length } = parseMacroArgs(input);
 
     if (length < 0) {
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Macro 'timeInterval' expects 1 argument(s), but got 0

[Killed] BlockStatement
src/macros.ts:276:21
     const end = start + match[0].length;
     const { args, length } = parseMacroArgs(input.slice(end));
 
-    if (length < 0) {
-      throw new Error('Failed to parse macro arguments');
-    }
+    if (length < 0) {}
 
     matches.push({ full: input.slice(start, end + length), args });
killedBy: validateRawSqlChartConfig degrades to no errors/warnings (instead of throwing) when the sqlTemplate is unparseable
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 7

  Object {
-   "errors": Array [],
-   "warnings": Array [],

[Killed] EqualityOperator
src/macros.ts:276:9
     const end = start + match[0].length;
     const { args, length } = parseMacroArgs(input.slice(end));
 
-    if (length < 0) {
+    if (length >= 0) {
       throw new Error('Failed to parse macro arguments');
     }
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Failed to parse macro arguments

[Killed] MethodExpression
src/macros.ts:280:26
       throw new Error('Failed to parse macro arguments');
     }
 
-    matches.push({ full: input.slice(start, end + length), args });
+    matches.push({ full: input, args });
   }
 
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "`default`.`otel_metrics_gauge`"
Received string:    "toStartOfInterval(toDateTime(TimeUnix), INTERVAL {intervalSeconds:Int64} second)"

[Killed] ArithmeticOperator
src/macros.ts:280:45
       throw new Error('Failed to parse macro arguments');
     }
 
-    matches.push({ full: input.slice(start, end + length), args });
+    matches.push({ full: input.slice(start, end - length), args });
   }
 
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: RangeError: Invalid string length

[Killed] StringLiteral
src/macros.ts:297:13
   const allMacros: Macro[] = [
     ...MACROS,
     {
-      name: 'filters',
+      name: "",
       minArgs: 0,
       maxArgs: 0,
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "$__"
Received string:        "WITH
  Source AS (
    SELECT
      *,
      cityHash64(ScopeAttributes, ResourceAttributes, Attributes) AS AttributesHash

[Killed] BlockStatement
src/macros.ts:314:48
           );
         }
 
-        if (args.length === 0 && metricTables) {
-          throw new Error(
-            "Macro '$__sourceTable(metricType)' requires a metricType when a metrics source is selected",
-          );
-        }
+        if (args.length === 0 && metricTables) {}
 
         if (args.length === 0 && !from.tableName) {
killedBy: replaceMacros should throw when $__sourceTable is used without a metricType but metricTables is set
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "requires a metricType when a metrics source is selected"

Received function did not throw

[Killed] EqualityOperator
src/macros.ts:314:13
           );
         }
 
-        if (args.length === 0 && metricTables) {
+        if (args.length !== 0 && metricTables) {
           throw new Error(
             "Macro '$__sourceTable(metricType)' requires a metricType when a metrics source is selected",
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Macro '$__sourceTable(metricType)' requires a metricType when a metrics source is selected

[Killed] ConditionalExpression
src/macros.ts:320:13
           );
         }
 
-        if (args.length === 0 && !from.tableName) {
+        if (true && !from.tableName) {
           throw new Error(
             "Macro '$__sourceTable' requires a source with a table to be selected when no arguments are provided",
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Macro '$__sourceTable' requires a source with a table to be selected when no arguments are provided

[Killed] LogicalOperator
src/macros.ts:320:13
           );
         }
 
-        if (args.length === 0 && !from.tableName) {
+        if (args.length === 0 || !from.tableName) {
           throw new Error(
             "Macro '$__sourceTable' requires a source with a table to be selected when no arguments are provided",
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: Macro '$__sourceTable' requires a source with a table to be selected when no arguments are provided

[Killed] EqualityOperator
src/macros.ts:326:13
           );
         }
 
-        if (args.length === 0) {
+        if (args.length !== 0) {
           return `\`${from.databaseName}\`.\`${from.tableName}\``;
         }
killedBy: replaceMacros should replace $__sourceTable with databaseName.tableName
statusReason: Error: Macro '$__sourceTable(metricType)' with a metric type argument requires a metrics source to be selected

[Killed] BlockStatement
src/macros.ts:326:32
           );
         }
 
-        if (args.length === 0) {
-          return `\`${from.databaseName}\`.\`${from.tableName}\``;
-        }
+        if (args.length === 0) {}
 
         if (!metricTables) {
killedBy: renderBuilderConfigAsSqlTemplate round-trips through replaceMacros into an executable, alert-valid query
statusReason: Error: Macro '$__sourceTable(metricType)' with a metric type argument requires a metrics source to be selected

[Killed] StringLiteral
src/macros.ts:327:18
         }
 
         if (args.length === 0) {
-          return `\`${from.databaseName}\`.\`${from.tableName}\``;
+          return ``;
         }
 
killedBy: renderBuilderConfigAsSqlTemplate round-trips through replaceMacros into an executable, alert-valid query
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "`default`.`otel_logs`"
Received string:    "SELECT
  count(),
  ServiceName,
  toStartOfInterval(toDateTime(timestamp), INTERVAL {intervalSeconds:Int64} second) AS `__hdx_time_bucket`
FROM···

[Killed] StringLiteral
src/macros.ts:339:13
         const metricsTypeParseResult = MetricsDataTypeSchema.safeParse(args[0]);
         if (!metricsTypeParseResult.success) {
           throw new Error(
-            `Macro '$__sourceTable(metricType)' invalid argument '${args[0]}'. Expected a valid metrics data type (${Object.values(MetricsDataType).join(', ')}).`,
+            ``,
           );
         }
killedBy: replaceMacros should throw when $__sourceTable is called with an invalid metric type
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Expected a valid metrics data type"
Received message:   ""

      503 |             } else {
      504 |               stryCov_9fa48("884");

[Killed] ConditionalExpression
src/macros.ts:345:13
 
         const metricType = metricsTypeParseResult.data;
         const table = metricTables[metricType];
-        if (!table) {
+        if (false) {
           throw new Error(
             `Macro '$__sourceTable(metricType)': No table configured for metric type '${metricType}'.`,
killedBy: replaceMacros should throw when $__sourceTable is called with a metric type that has no table
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No table configured for metric type 'gauge'"

Received function did not throw

[Killed] BlockStatement
src/macros.ts:345:21
 
         const metricType = metricsTypeParseResult.data;
         const table = metricTables[metricType];
-        if (!table) {
-          throw new Error(
-            `Macro '$__sourceTable(metricType)': No table configured for metric type '${metricType}'.`,
-          );
-        }
+        if (!table) {}
         return `\`${from.databaseName}\`.\`${table}\``;
       },
killedBy: replaceMacros should throw when $__sourceTable is called with a metric type that has no table
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No table configured for metric type 'gauge'"

Received function did not throw
