[Killed] StringLiteral
src/macros.ts:347:13
         const table = metricTables[metricType];
         if (!table) {
           throw new Error(
-            `Macro '$__sourceTable(metricType)': No table configured for metric type '${metricType}'.`,
+            ``,
           );
         }
killedBy: replaceMacros should throw when $__sourceTable is called with a metric type that has no table
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No table configured for metric type 'gauge'"
Received message:   ""

      513 |             } else {
      514 |               stryCov_9fa48("890");
    > 515 |               throw new Error(stryMutAct_9fa48("891") ? `` : (stryCov_9fa48("891"), `Macro '$__sourceTable(metricType)': No table configured for metric type '${metricType}'.`

[Survived] MethodExpression
src/macros.ts:355:24
     },
   ];
 
-  const sortedMacros = allMacros.sort(
-    (m1, m2) => m2.name.length - m1.name.length,
-  );
+  const sortedMacros = allMacros;
 
   let sql = chartConfig.sqlTemplate;

[Survived] ArithmeticOperator
src/macros.ts:356:17
   ];
 
   const sortedMacros = allMacros.sort(
-    (m1, m2) => m2.name.length - m1.name.length,
+    (m1, m2) => m2.name.length + m1.name.length,
   );
 

[Killed] BlockStatement
src/macros.ts:360:37
   );
 
   let sql = chartConfig.sqlTemplate;
-  for (const macro of sortedMacros) {
-    const matches = findMacros(sql, macro.name);
-
-    for (const match of matches) {
-      sql = sql.replaceAll(match.full, macro.replace(match.args));
-    }
-  }
+  for (const macro of sortedMacros) {}
 
   return sql;
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "$__"
Received string:        "WITH
  Source AS (
    SELECT
      *,
      cityHash64(ScopeAttributes, ResourceAttributes, Attributes) AS AttributesHash

[Killed] BlockStatement
src/macros.ts:363:34
   for (const macro of sortedMacros) {
     const matches = findMacros(sql, macro.name);
 
-    for (const match of matches) {
-      sql = sql.replaceAll(match.full, macro.replace(match.args));
-    }
+    for (const match of matches) {}
   }
 
killedBy: renderBuilderConfigAsSqlTemplate metric charts (single-series only) resolves the metric source-table macro through replaceMacros
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "$__"
Received string:        "WITH
  Source AS (
    SELECT
      *,
      cityHash64(ScopeAttributes, ResourceAttributes, Attributes) AS AttributesHash
