[NoCoverage] BooleanLiteral
src/dashboardValidation.ts:41:33
   // loop reports it.
   const containerById = new Map<string, ContainerForValidation>();
   const seenContainerIds = new Set<string>();
-  let hasDuplicateContainerId = false;
+  let hasDuplicateContainerId = true;
   containers.forEach((container, containerIdx) => {
     if (seenContainerIds.has(container.id)) {

[NoCoverage] ConditionalExpression
src/dashboardValidation.ts:43:9
   const seenContainerIds = new Set<string>();
   let hasDuplicateContainerId = false;
   containers.forEach((container, containerIdx) => {
-    if (seenContainerIds.has(container.id)) {
+    if (true) {
       hasDuplicateContainerId = true;
       ctx.addIssue({

[NoCoverage] ConditionalExpression
src/dashboardValidation.ts:43:9
   const seenContainerIds = new Set<string>();
   let hasDuplicateContainerId = false;
   containers.forEach((container, containerIdx) => {
-    if (seenContainerIds.has(container.id)) {
+    if (false) {
       hasDuplicateContainerId = true;
       ctx.addIssue({

[NoCoverage] BooleanLiteral
src/dashboardValidation.ts:44:33
   let hasDuplicateContainerId = false;
   containers.forEach((container, containerIdx) => {
     if (seenContainerIds.has(container.id)) {
-      hasDuplicateContainerId = true;
+      hasDuplicateContainerId = false;
       ctx.addIssue({
         code: z.ZodIssueCode.custom,

[NoCoverage] StringLiteral
src/dashboardValidation.ts:47:18
       hasDuplicateContainerId = true;
       ctx.addIssue({
         code: z.ZodIssueCode.custom,
-        message: `Container IDs must be unique: "${container.id}"`,
+        message: ``,
         path: [...containersPath, containerIdx, 'id'],
       });

[NoCoverage] BlockStatement
src/dashboardValidation.ts:50:12
         message: `Container IDs must be unique: "${container.id}"`,
         path: [...containersPath, containerIdx, 'id'],
       });
-    } else {
-      seenContainerIds.add(container.id);
-      containerById.set(container.id, container);
-    }
+    } else {}
 
     if (container.tabs) {

[NoCoverage] BlockStatement
src/dashboardValidation.ts:55:25
       containerById.set(container.id, container);
     }
 
-    if (container.tabs) {
-      const seenTabIds = new Set<string>();
-      container.tabs.forEach((tab, tabIdx) => {
-        if (seenTabIds.has(tab.id)) {
-          ctx.addIssue({
-            code: z.ZodIssueCode.custom,
-            message: `Duplicate tab id "${tab.id}" in container "${container.id}"`,
-            path: [...containersPath, containerIdx, 'tabs', tabIdx, 'id'],
-          });
-        }
-        seenTabIds.add(tab.id);
-      });
-    }
+    if (container.tabs) {}
   });
 

[NoCoverage] BlockStatement
src/dashboardValidation.ts:57:47
 
     if (container.tabs) {
       const seenTabIds = new Set<string>();
-      container.tabs.forEach((tab, tabIdx) => {
-        if (seenTabIds.has(tab.id)) {
-          ctx.addIssue({
-            code: z.ZodIssueCode.custom,
-            message: `Duplicate tab id "${tab.id}" in container "${container.id}"`,
-            path: [...containersPath, containerIdx, 'tabs', tabIdx, 'id'],
-          });
-        }
-        seenTabIds.add(tab.id);
-      });
+      container.tabs.forEach((tab, tabIdx) => {});
     }
   });

[NoCoverage] ConditionalExpression
src/dashboardValidation.ts:58:13
     if (container.tabs) {
       const seenTabIds = new Set<string>();
       container.tabs.forEach((tab, tabIdx) => {
-        if (seenTabIds.has(tab.id)) {
+        if (true) {
           ctx.addIssue({
             code: z.ZodIssueCode.custom,

[NoCoverage] ConditionalExpression
src/dashboardValidation.ts:58:13
     if (container.tabs) {
       const seenTabIds = new Set<string>();
       container.tabs.forEach((tab, tabIdx) => {
-        if (seenTabIds.has(tab.id)) {
+        if (false) {
           ctx.addIssue({
             code: z.ZodIssueCode.custom,

[NoCoverage] ArrayDeclaration
src/dashboardValidation.ts:62:19
           ctx.addIssue({
             code: z.ZodIssueCode.custom,
             message: `Duplicate tab id "${tab.id}" in container "${container.id}"`,
-            path: [...containersPath, containerIdx, 'tabs', tabIdx, 'id'],
+            path: [],
           });
         }

[NoCoverage] StringLiteral
src/dashboardValidation.ts:94:42
   ctx: z.RefinementCtx,
   paths?: { tilesPath?: (string | number)[] },
 ): void {
-  const tilesPath = paths?.tilesPath ?? ['tiles'];
+  const tilesPath = paths?.tilesPath ?? [""];
 
   tiles.forEach((tile, tileIdx) => {

[NoCoverage] ArrayDeclaration
src/dashboardValidation.ts:94:41
   ctx: z.RefinementCtx,
   paths?: { tilesPath?: (string | number)[] },
 ): void {
-  const tilesPath = paths?.tilesPath ?? ['tiles'];
+  const tilesPath = paths?.tilesPath ?? [];
 
   tiles.forEach((tile, tileIdx) => {

[NoCoverage] BlockStatement
src/dashboardValidation.ts:97:41
   const tilesPath = paths?.tilesPath ?? ['tiles'];
 
   tiles.forEach((tile, tileIdx) => {
-    if (tile.containerId !== undefined) {
-      const container = containerById.get(tile.containerId);
-      if (!container) {
-        ctx.addIssue({
-          code: z.ZodIssueCode.custom,
-          message: `Tile references unknown containerId "${tile.containerId}"`,
-          path: [...tilesPath, tileIdx, 'containerId'],
-        });
-      }
-    }
+    if (tile.containerId !== undefined) {}
 
     if (tile.tabId !== undefined) {

[NoCoverage] ConditionalExpression
src/dashboardValidation.ts:99:11
   tiles.forEach((tile, tileIdx) => {
     if (tile.containerId !== undefined) {
       const container = containerById.get(tile.containerId);
-      if (!container) {
+      if (true) {
         ctx.addIssue({
           code: z.ZodIssueCode.custom,

[NoCoverage] BlockStatement
src/dashboardValidation.ts:99:23
   tiles.forEach((tile, tileIdx) => {
     if (tile.containerId !== undefined) {
       const container = containerById.get(tile.containerId);
-      if (!container) {
-        ctx.addIssue({
-          code: z.ZodIssueCode.custom,
-          message: `Tile references unknown containerId "${tile.containerId}"`,
-          path: [...tilesPath, tileIdx, 'containerId'],
-        });
-      }
+      if (!container) {}
     }
 

[NoCoverage] StringLiteral
src/dashboardValidation.ts:102:20
       if (!container) {
         ctx.addIssue({
           code: z.ZodIssueCode.custom,
-          message: `Tile references unknown containerId "${tile.containerId}"`,
+          message: ``,
           path: [...tilesPath, tileIdx, 'containerId'],
         });

[NoCoverage] EqualityOperator
src/dashboardValidation.ts:108:9
       }
     }
 
-    if (tile.tabId !== undefined) {
+    if (tile.tabId === undefined) {
       if (tile.containerId === undefined) {
         ctx.addIssue({

[NoCoverage] BlockStatement
src/dashboardValidation.ts:108:35
       }
     }
 
-    if (tile.tabId !== undefined) {
-      if (tile.containerId === undefined) {
-        ctx.addIssue({
-          code: z.ZodIssueCode.custom,
-          message: 'tabId requires containerId to be set',
-          path: [...tilesPath, tileIdx, 'tabId'],
-        });
-        return;
-      }
-      const container = containerById.get(tile.containerId);
-      if (!container) return;
-      const tab = container.tabs?.find(t => t.id === tile.tabId);
-      if (!tab) {
-        ctx.addIssue({
-          code: z.ZodIssueCode.custom,
-          message: `Tile references unknown tabId "${tile.tabId}" in container "${tile.containerId}"`,
-          path: [...tilesPath, tileIdx, 'tabId'],
-        });
-      }
-    }
+    if (tile.tabId !== undefined) {}
   });
 }

[NoCoverage] ArrayDeclaration
src/dashboardValidation.ts:113:17
         ctx.addIssue({
           code: z.ZodIssueCode.custom,
           message: 'tabId requires containerId to be set',
-          path: [...tilesPath, tileIdx, 'tabId'],
+          path: [],
         });
         return;

[NoCoverage] ConditionalExpression
src/dashboardValidation.ts:119:45
       }
       const container = containerById.get(tile.containerId);
       if (!container) return;
-      const tab = container.tabs?.find(t => t.id === tile.tabId);
+      const tab = container.tabs?.find(t => true);
       if (!tab) {
         ctx.addIssue({

[NoCoverage] ConditionalExpression
src/dashboardValidation.ts:119:45
       }
       const container = containerById.get(tile.containerId);
       if (!container) return;
-      const tab = container.tabs?.find(t => t.id === tile.tabId);
+      const tab = container.tabs?.find(t => false);
       if (!tab) {
         ctx.addIssue({

[NoCoverage] BooleanLiteral
src/dashboardValidation.ts:120:11
       const container = containerById.get(tile.containerId);
       if (!container) return;
       const tab = container.tabs?.find(t => t.id === tile.tabId);
-      if (!tab) {
+      if (tab) {
         ctx.addIssue({
           code: z.ZodIssueCode.custom,

[NoCoverage] ConditionalExpression
src/dashboardValidation.ts:120:11
       const container = containerById.get(tile.containerId);
       if (!container) return;
       const tab = container.tabs?.find(t => t.id === tile.tabId);
-      if (!tab) {
+      if (true) {
         ctx.addIssue({
           code: z.ZodIssueCode.custom,

[NoCoverage] StringLiteral
src/dashboardValidation.ts:124:41
         ctx.addIssue({
           code: z.ZodIssueCode.custom,
           message: `Tile references unknown tabId "${tile.tabId}" in container "${tile.containerId}"`,
-          path: [...tilesPath, tileIdx, 'tabId'],
+          path: [...tilesPath, tileIdx, ""],
         });
       }
